[{"model": "chapters.chapter", "pk": 34, "fields": {"title": "Introduction", "subtitle": "<p>Introduction</p>", "content": "<div class=\"content\">\r\n<p>I don't normally read books, but being alone for these past months has led me to seek solace in the local library. Upon entering, I was struck by its great location and the vast array of books it held. I wandered through the different categories and stumbled upon autobiographies. Despite never having delved into autobiographical works before, I thought, why not? They're factual and potentially interesting.</p>\r\n<p>So, I selected one about a person whom I've long admired and found myself thoroughly engrossed in every chapter. This experience reignited my passion for reading. However, I couldn't help but notice that all the autobiographies available were about well-known figures&mdash;celebrities, if you will. It made me wonder, would anyone be interested in the life story of an ordinary person?</p>\r\n<p>Now, as the end of May 2024 approaches and I find myself at the age of 85, feeling more like 65, I've come to realize that age is just a number. Inspired by the stories I've encountered, I pondered whether my own life experiences hold any value or interest to others. Thus, while awaiting the return of my partner and in an effort to keep myself occupied, I've decided to embark on recounting my story.</p>\r\n<p>To anyone reading this, I wish you luck. You may find yourself either thoroughly bored or perhaps uncovering some meaningful message within my writings. Either way, I extend my best wishes to you. Good luck.</p>\r\n<p>I don't usually read books, but spending these past months alone has led me to seek solace in the local library. Upon entering, I was struck by its great location and the vast array of books it held. I wandered through different categories and stumbled upon autobiographies. Although I had never delved into autobiographical works before, I thought, why not? They're factual and potentially interesting.</p>\r\n<p>I chose one about a person I've long admired and found myself thoroughly engrossed in every chapter. This experience reignited my passion for reading. However, I couldn&rsquo;t help but notice that all the autobiographies available were about well-known figures&mdash;celebrities, if you will. It made me wonder, would anyone be interested in the life story of an ordinary person?</p>\r\n<p>Now, as May 2024 approaches and I find myself at the age of 85, feeling more like 65, I've come to realize that age is just a number. Inspired by the stories I've encountered, I've begun to ponder whether my own life experiences hold any value or interest to others. So, while waiting for the return of my partner and in an effort to keep myself occupied, I've decided to recount my story.</p>\r\n<p>To anyone reading this, I wish you luck. You might find yourself thoroughly bored or perhaps uncover some meaningful message within my writings. Either way, I extend my best wishes to you. Good luck.</p>\r\n</div>", "cover_image": "images/New_Zealand_Trip.jpg", "slug": "introduction", "created_at": "2025-06-29T10:49:14.244Z", "updated_at": "2025-07-03T07:28:13.358Z", "order": 1}}, {"model": "chapters.chapter", "pk": 35, "fields": {"title": "Chapter 5", "subtitle": "<p>Clare House-Life's twists and turns often unfold swiftly, leaving us with little control over the course of events .</p>", "content": "<div class=\"content\">\r\n<p>After<a href=\"../../../media/images/wedding.jpg\" target=\"_blank\" rel=\"noopener\">&nbsp;Micheal &amp; Irene</a><a href=\"../../../static/images/wedding.jpg\">&nbsp;</a>were married, they stayed on at Clare House for a few more months until they found somewhere to live, and then they moved out. Biddy continued to be a great help to my mother, providing much-needed support during a challenging time.<br>Then, one day, a new person arrived at Clare House. He was introduced to me as Eddie, the brother of one of my uncles, although I wasn't aware of our family connection at the time. Little did I know that he was soon going to become my stepfather, bringing significant changes to our lives. At that time, I lacked the business acumen and knowledge required to run a business, and I could sense that my mother must have been feeling overwhelmed, both emotionally and financially, since the loss of Dad.<br>Eddie's arrival seemed to offer a glimmer of hope and stability, and before long, he and my mother were married. As for us boys, Phillip and I were too young to fully comprehend the implications of the marriage. Meanwhile, Micheal, Lionel, and David were preoccupied with their own lives and responsibilities.<br>In the initial months following Eddie's arrival, things felt somewhat awkward. I wasn't sure what to say or how to interact, so I stuck to my usual routine. Each morning, around 7 o'clock, I'd make a trip to the local bakery, conveniently located just across the road in an area known as Winchelsea Rd. The bakery, nestled into the side of a hill, was a fascinating sight for a young boy like me. Stepping inside, I'd be greeted by the aroma of freshly baked bread and the sight of large mixers and ovens. Eagerly, I'd collect our order and hurry back home to clare House, enjoying the taste of a fresh crusty roll along the way.<br>This routine repeated itself three days a week, depending on how busy clare House was. Upon my return, Eddie would often be up and about, preparing tea for Mum and himself. We'd exchange greetings, and then I'd settle down to have some breakfast before heading off to school. The routine became familiar, and we all adjusted to our new dynamic.<br>However, our lives were soon to undergo another significant change with the news of Mum's pregnancy. Over the next three years, she brought four more children into the world: Tony, Carol, and twins Steven and Paul. While this undoubtedly brought joy and fulfillment to Eddie, for me, Phillip, and perhaps even Mum, it introduced a new set of challenges and adjustments. The dynamics of our family shifted once again, as we navigated the complexities of welcoming new siblings and adjusting to our evolving family structure<br>In time as Tony grew he joined Phillip and myself on our outings where would go for an outing the beach and spend a couple hours there. Tony would be in the push chair and I would Phillip walking beside some time I let him stand on the side of the push so he could ride giving him a rest times.<br>This particular day we were watching men working on some sea defenses it was all fenced off with wire fencing and we stood there on the outside of the fence and watched them going about there work. At the site there was a crane well inside of the fenced site it was what it looked to me anyway the crane started up and was manoeuvring into position when the iron hook on the end of the line swung round over the wire fence onto our side and whacked Phillip on the side of his head, it happened all to quickly to do anything to get out of the way.<br>The workmen stood in horror seeing just what had happened some of them rushed around to give some assistance. The side of Phillips head became a terrible sight enlarged and blue looking. The foreman I presumed he was the foreman got hold of Phillip and rushed him to the hospital. leaving me and Tony in a state of distress.<br>However one of the workmen got us into vehicle and drove us to the hospital where Phillip was it was good that the foreman got Phillip to the hospital quickly where placed ice packs on to bring swelling down they X rayed him, all was good no damage.<br>To this day I still have dreams about it, how Phillip looked with a big blue swelling on the side of his face. Of course I was interrogated by Mum as to how this could of happened. It was a few weeks before we could all get over it. Which Phillip did with no after effects.<br>As Tony grew older, it became increasingly evident that he faced challenges with normal childhood tasks. It became apparent that he would require special needs support as he continued to grow. Meanwhile, Carol blossomed into a lovely little girl, eager to assist our mother and Tony to the best of her abilities. However, managing the twins proved to be quite a handful.<br>Occasionally, guests would stay at clare House, requiring full board accommodation with breakfast, lunch, and dinner provided. Our mother, as always, was the mainstay in the kitchen. When Dad was alive, meal preparation was a collaborative effort between them, often turning into a friendly competition to see who could create the tastiest dish. Of course, Mum emerged victorious every time, but it added a fun element to the tasks.<br><br>However, after Dad's passing, it became evident that Eddie lacked culinary skills. Even serving the meals proved to be a challenge for him, as he had spent most of his life as a seaman and had little experience in the kitchen.<br>With Mum's pregnancy, there were times when she couldn't be in the kitchen at all. Recognizing this, Mum began teaching me some simple recipes that I could prepare during her absences to help manage the cooking duties. I did have Biddy around at times to assist me<br>Returning to the present, it was clear that Eddie lacked culinary skills. Despite his years spent at sea as a seaman, cooking and serving meals were foreign tasks to him. Nonetheless, he had to adapt and do his best to contribute to the household.<br>Unbeknown to me, this experience laid the foundation for a future career in hospitality. Academic pursuits held little appeal for me, especially as I witnessed the challenges at home.<br>It seemed that Eddie was grappling with alcoholism, likely exacerbated by the pressures of managing clare House. Despite this, he still had responsibilities beyond the business, with four children needing his attention.<br>Eddie often requested that I fetch him a bottle of gin from the pub or off-license, a task I used to fulfill without question. However, as his drinking habits became more apparent, I began to avoid his requests, preferring not to be around when he asked.<br><br>When my brothers learned about what was happening, they banded together to support our mother and attempted to remove Eddie from the picture. However, Mum adamantly refused to entertain the idea. As for me, I was in no position to take any action, so the matter was eventually set aside, and we continued with our lives.<br><br>The children were growing rapidly, with Carol increasingly assisting Mum. Tony received aid for his disabilities, while the twins continued to be a handful, lacking the firm guidance they needed from their father. Though I earned some respect from them, I didn't interact with them much. Phillip, on the other hand, spent most days with them.<br><br>In my final year at school, I still had to leave when Religious Education was taught, and instead this year, I attended music lessons. The previous year, it was art with Mr. Beaumont, a nice guy, but I struggled with art. The year before that was woodwork with Mr. Hayward, an elderly gentleman, but that was even more challenging for me. So, music it was for my last year, taught by Mr. Dickinson.<br>It was in this class that I met my best mate &amp; only friend I had made at this school, Sid King. I can't recall why he was in this class, but we bonded instantly, despite coming from different backgrounds - me from Folkestone Road and Sid from Clarendon Road.<br><br>Throughout the year, we were inseparable. After school, we'd often head to the cinema or occasionally take the bus to the Folkestone swimming pool. At some point, we both enrolled in The Big Brother Scheme to immigrate to Australia. Surprisingly, our parents gave us permission, perhaps eager to see us venture out on our own. We even went as far as having chest X-rays, and we both passed. However, after going through all the paperwork and preparations, Sid decided he didn't want to go through with it, and I certainly wasn't going to go alone.<br>Despite that, Sid and I remained great friends until we eventually lost contact when we both left to start our working lives.<br>As my birthday fell in February, I could leave school at the Easter break, which I did. In Dover during that period, the primary employment options were either working on the cross-channel ferries when they resumed for the summer season or in the coalmines, of which there were three not too far from Dover. However, working in the mines was definitely not something I had in mind. Instead, I decided to apply for a job on the cross-channel ferries, which started operating again at Easter. I was hired.</p>\r\n</div>", "cover_image": "images/claireHouse.jpg", "slug": "chapter-5", "created_at": "2025-06-29T10:49:14.275Z", "updated_at": "2025-07-03T07:26:19.913Z", "order": 6}}, {"model": "chapters.chapter", "pk": 36, "fields": {"title": "Chapter 6", "subtitle": "<p>The beginning of my working life marked a significant transition, filled with uncertainty about what lay ahead and where this journey would ultimately take me.</p>", "content": "<div class=\"content\">\r\n<p>When the time came for us to part ways, realizing that neither Sid nor I would be going to Australia, I found myself at a loss regarding what to do next. Syd faced a similar uncertainty; his father worked in the mines, but Syd was adamant about not following in his footsteps. I can't recall if Syd left school at the same time as me.</p>\r\n<p>And so, without any formal send-off, I bid farewell to school.</p>\r\n<p>&nbsp;However, the options available to me in the 1950s were incredibly limited. I wasn't academically inclined, so pursuing further education wasn't a viable path. Moreover, employment opportunities in Dover, only five years after the war, were practically nonexistent.<br>The only immediate option seemed to be the cross-channel ferries, which were gearing up for their summer season. However, this line of work meant being stuck in a cycle of seasonal employment, working only six months out of the year. The alternative was staying put at clare House, but with Eddie's behavior worsening, particularly due to the twins' antics, that wasn't a feasible option. Therefore, the logical choice was to embark on a season with the ferries, gaining some work experience and, hopefully, saving up some money. Then, after the six-month stint, I could start exploring opportunities beyond Dover.With that plan in mind I would still be in a position to help and assist Mum where I can also keep an eye out for Phillip, Tony, and Carol<br><br>Nearly all of the shipping, including ferries, docks at two locations in Dover Harbour: the Eastern Arm Docks and the Western Arm Docks. At the Eastern Arm, the ships primarily carry vehicles and passengers, while the Western Arm Docks cater mainly to walk-on passengers and other vessels that transport trains across the channel. One such train is the famous&nbsp; <a href=\"https://en.wikipedia.org/wiki/Golden_Arrow_(train)\" target=\"_blank\" rel=\"noopener\">Golden Arrow</a>, which departs from London Victoria, boards the ferry, and continues its journey to Paris, France. The Western Docks operate year-round, whereas the Eastern Arm Docks were seasonal until the early 1960s when they began operating year-round.<br>So on the 30th of March 1955, I went through the formalities of registering as a seaman. (Well, as a Pantry Boy, you have to start somewhere.) In fact, I had joined the Merchant Navy. At the time, it didn't occur to me that I would essentially be part of the Navy, albeit not the Royal Navy. Regardless, I was now a part of an organization at just fifteen years old. The experience was a mix of excitement and fear. In the registration office, I was surrounded by seasoned sailors signing up for the same ship, making me feel like nothing more than a boy amidst men<br>With the 1955 season starting , and I have signed articles as a Pantry Boy I can now join as part of the crew on a vessel named&nbsp;<a href=\"../../../static/images/halladale.jpeg\">TSS Halladale</a>&nbsp;, a converted naval frigate. This vessel was designed to accommodate and transport passengers and their vehicles across the English Channel, featuring a roll-on, roll-off conversation system.<br>As dawn broke, we gathered at the&nbsp;<a href=\"../../../static/images/ramps.jpg\">Eastern Docks</a>, awaiting the arrival of the ship freshly refitted for the summer season. With precision, it backed in, aligning the stern for the ramp's descent, welcoming us aboard.<br>A diverse mix of personnel streamed onto the ship. Some wore uniforms, likely officers, while others, sporting sailors' hats and sturdy jeans, assumed the roles of deckhands. Then there were those, like myself, dressed casually, presumably part of the catering team.<br>Navigating the ship seemed daunting for those of us in civilian attire until a friendly face introduced himself as the Second Steward, guiding us to the restaurant area. Following his lead, we embarked on a quick tour of the decks, familiarizing ourselves with our workspaces. Amidst the group, I noticed I was likely the youngest, surrounded by seasoned men engaged in conversation and introductions.<br>Once settled, assignments were distributed, along with the areas each of us was tasked with keeping spotless. Quickly, I learned the term \"scrubout\" - my domain being the toilets. Alongside me was Les Aston, who swiftly became a trusted friend, imparting invaluable lessons on seafaring work ethics.<br>As a recent school leaver, stepping into my role as a Pantry boy aboard the ship marked the beginning of a journey into the world of maritime service. In those initial days, our focus was on preparing the vessel for the upcoming summer season of sailings, despite its recent refit.<br>The interior of the ship demanded our attention, requiring thorough cleaning and the meticulous arrangement of furniture to ensure the comfort of our passengers. On the main deck, a bustling array of amenities awaited, from the inviting allure of the Bar and the allure of the Duty-Free shop to the culinary delights of the Buffet and Restaurant. Below deck lay the essential facilities of bathrooms and toilets, vital for the convenience of all on board. However, our duties extended beyond mere cleanliness. As the ship prepared for its voyages, stocking up on provisions was paramount. The Duty-Free shop, in particular, demanded careful attention, with its array of bonded goods requiring meticulous handling. I vividly recall the formalities surrounding the arrival of cigarettes, spirits, and liquor, each carton subject to scrutiny by a customs agent before being secured below deck.<br>The process of stocking up was a well-choreographed routine, with the crew forming a line to transport the goods from the delivery point to their designated storage area. Each crew member played a vital role, passing the cargo along until it reached its final destination. This ritual would be repeated countless times throughout the summer season, a testament to the meticulous preparation required for each voyage. Amidst the hustle and bustle of provisioning, there were moments of quiet reflection as well. As passengers embarked and disembarked, I found myself returning repeatedly to my designated \"scrubout\" areas, under the watchful eye of seasoned crew members. It was a period of intense learning, with each repetition honing my skills until my work met the exacting standards of cleanliness expected at sea.<br>During the crossings, my days were predominantly spent in the pantry, where the steady rhythm of washing up became second nature. It was a role that demanded diligence and attention to detail, qualities I endeavored to cultivate as I embraced my responsibilities on board. In retrospect, those early days were filled with challenges and opportunities for growth, laying the foundation for the adventures that lay ahead on the open sea.<br>Continuing on, I spent two more summer seasons on board, being laid off each winter. During those winters, I found employment in various hotels. It wasn't until 1956, when I came of age to drive, that I managed to acquire an old second-hand car. Around that time, the conflict known as the Seven-Day War erupted between Egypt and Israel. Despite the turmoil, I pursued diving lessons and obtained a provisional driving license. Interestingly, due to the war, I was granted the privilege to drive without supervision. This newfound freedom allowed me to seek live-in jobs outside of Dover until the next summer season, a routine I maintained for the following three years.<br>In May 1957, however, I seized a different opportunity. Hearing that another ship was desperately short of Assistant Stewards, I decided to apply, aiming to elevate my rating from Pantry boy. Despite being just 17, a year shy of the official requirement for the role, the shortage of crew members worked in my favor. They signed me up and stamped my discharge book, granting me an adult rate of pay. After a couple of months in this new role, I returned to Dover with my upgraded rating. There, I joined the SS Dinnard as an Assistant Steward, remaining with the ship until November 1957. Subsequently, I returned to the Halladale, where I stayed until late 1958.<br>During one of my winter layoffs, I found myself seeking employment in hotels through a specialized catering employment agency. On my first assignment with the agency, they sent me to the Casino Hotel on Taggs Island, Hampton Court, London, where they were in need of a commie-barman.<br>Armed with my car and the ability to drive, I packed my meager belongings and embarked on the journey to London, a little over two hours away. Arriving at<a href=\"../../../media/images/taggs-island.jpg\">&nbsp;Taggs Island </a>, I was struck by its unique setting with a small bridge spanning the Thames led to the island, entirely occupied by the hotel, with houseboats moored all around. After a brief interview with the resident cocktail barman, during which we discussed my duties and I was outfitted with the hotel's uniform, I was shown to my living quarters a houseboat moored nearby. As I changed into the uniform, the barman returned to his post, and it was already mid-afternoon.<br>The cocktail bar itself resembled those seen in movies, with a mirrored backdrop showcasing an array of glassware and spirits from around the world. Although I recognized some, many were unfamiliar, and I knew I had much to learn. The oval-shaped bar was surrounded by stools, awaiting the arrival of patrons. Feeling somewhat professional, thanks to my experience in a pub, albeit on a smaller scale, I was left to begin my tasks while the barman went for his lunch. With cleaning being my second nature, given my previous experience cleaning ship toilets, I tackled the task in stages, starting with the back mirrors.<br>However, my concentration was soon interrupted by the arrival of two customers a young couple with distinctly posh accents. Attempting to remain composed, I greeted them and inquired how I could assist. Their order a pair of brandy Alexanders left me momentarily flustered, but I assured them it was my first day and set about gathering the ingredients.<br>Unfortunately, my attempt at shaking the cocktail went awry when I forgot to secure the lid on the shaker, resulting in a messy splatter of brandy, creme de cacao, and cream across the freshly cleaned back mirror. Despite their initial disappointment, the couple found humor in the situation, and we shared a laugh at my expense until the barman returned, his expression a mixture of shock and amusement at the sight before him.<br><a title=\"Taggs Island\" href=\"static/images/taggs.jpg\">Taggs Island</a> indeed marked the beginning of my journey as a commie-barman, a role filled with both challenges and rewards. However, as winter settled in and the chill of the nights grew sharper, the discomfort of sleeping on the houseboat became increasingly unbearable. Despite my appeals for additional bedding being met with denial and an indifferent response to my discomfort, I made the difficult decision to depart, packing my belongings and leaving on Christmas day. Shortly after, I joined the crew of the SS Dinnard, where I encountered Charlie Byrom, another steward. Charlie took me under his wing, showing kindness and mentorship. He became not just a colleague, but a friend, and I fondly recall the valuable lessons he imparted about the steward's role. It was a memorable experience aboard the SS Dinnard, and Charlie's invitation to spend Christmas with his family in Sittingbourne added to the warmth of the season. With that invitation in mind, I found the courage to bid farewell to Taggs Island, knowing there was another place where I belonged.</p>\r\n</div>", "cover_image": "images/ramps1953.jpg", "slug": "chapter-6", "created_at": "2025-06-29T10:49:14.297Z", "updated_at": "2025-07-03T07:25:37.185Z", "order": 7}}, {"model": "chapters.chapter", "pk": 37, "fields": {"title": "chapter 7", "subtitle": "<p>The Bull dates back to the 1300's as a coaching inn offering respite to weary travellers along the Pilgrim's Way. An infamous haunt of smuggling gangs was the \"Bull Inn.\" In 1799 a gang leader, Lieutenant Colonel Shadwell, was shot dead on 1st June by an army deserter, and his comrades wreaked a terrible revenge. The murderer and his comrade were savagely beaten to death by the smugglers, an event recorded on a stone set into the wall by the hotel. \"With an eclectic past, including being the headquarters of a renowned gang of smugglers, as well as a favourite watering hole for Battle of Britain pilots, the 600 hundred year old Bull is now a beautiful four star country retreat as well as a gourmet dining destination with an AA rosette for culinary excellence.</p>", "content": "<div class=\"content\">\r\n<p>During my time in 1958, I embarked on a transformative journey within the vibrant hospitality industry. Following my seasonal stint aboard the Halladale, I found myself at a crossroads. Uncertain of my future in Dover and seeking a more enduring career path, I made the bold decision to pursue my passion for hospitality. In July of 1958, I took the leap and reached out to an agency, expressing my aspirations for a career in this dynamic field. Soon after, an opportunity emerged at the Bull Hotel, where I was warmly welcomed into the fold. As a waiter, I found myself under the tutelage of the esteemed head waiter, Alan Baines, whose jovial demeanor and wealth of experience enriched my journey. Under his guidance, I honed my skills in the art of service, mastering the intricacies of fine dining and customer care. He was quite a character. He had a way of making you feel at ease, even when the restaurant was bustling with activity. His attention to detail and dedication to his craft inspired me to strive for excellence in my own work. At the Bull Hotel, renowned for its culinary prowess, I embraced the intricacies of service, from assisting patrons with flair to learning the art of tableside cooking. The restaurant buzzed with activity, the ceilng in the the public is adorned with the signatures of valiant fighter pilots from World War II, a testament to the hotel's rich history. Among the eclectic clientele, one figure stood out Colonel Whintel, distinguished by his monocle and refined mannerisms. His presence added a touch of intrigue to our bustling establishment, as tales of his past escapades echoed through the halls. In the midst of culinary delights and memorable encounters, I found friendship among fellow staff members from the diligentcouple barmen to the dedicated housekeepers. The proprietors, Mr. and Mrs. Dixon, presided over the bustling establishment, their vision and dedication shaping the hotel's legacy. As I immersed myself in the vibrant tapestry of hospitality at the Bull Hotel, I discovered not only a career path but also a sense of belonging within a community driven by passion and friendship. Other employees were a couple of barmen one for the public and one for cocktail bar, couple of house keepers, and of course the kitchen staff. The owners were always about Mr Mrs Dixon and then were was another Mrs Dixon could not really find out where she fitted in the. One the housekeepers told she was the former wife of Mr Dixon!!!! After being there for a couple months they started to renovations to the hotel making the restaurant bigger and creating a lovely timber bar area. With the new extensions couple of new employees joined us. One of them was a young Irish girl to join me and Alan in the restaurant. we all worked well together the three of us were a good team in the restaurant. Till after one really busy weekend we get up for the breakfast shift on the Sunday morning only to be told that Alan had gone and taking all the monies + &amp; from the gratuities.<br>Sheila and I were getting on well with each other and spent our break times and eventually going out on our days off together. Sheila owned a Lambretta and we used this to get around the countryside. When would rode out me as a passenger on the back. But it did not take long before Sheila relinquished the driving and asked me to take over, we also spent many hours walking in the countryside. We had lots of outings and when the weather was not good we listened to radio Luxembourg which was the best radio station at that time.<br>While Sheila was older than me, we found ourselves engaging in conversations on various topics, discovering a compatibility in our opinions. One topic of discussion was my desire to move to Australia or New Zealand, which we both agreed would be an exciting opportunity. Throughout our conversations, it became evident to me that Sheila was a devout Catholic. This fact didn't concern me much, and I simply mentioned to Sheila that I was uncertain about my own beliefs, leaving the matter at that. I knew that eventually, we would need to have a more in-depth discussion about our differing beliefs.<br>Sheila lived in the hotel had lovely room which it was one of the guests room, my room was above the old stables the other guys were on the same floor. There was young cocktail barman in his twenties in the next room we got on well he was older than me and with it more experience of our work and of life. I suppose I was taken in by him and hung on his every word. He was talking of going to Spain to get some working experience at the time I said I would love to go with him. We made plans to do this.<br>Before I moved to the Bull hotel I had a suit made for me it was in the Italian style of the time, pale blue, I was very proud of it and felt grand when I was wearing. This barman I cannot remember his name, saw the suit hanging in my wardrobe then asked if he could try it on we were of the same build being naive I let him take it away to his room it was in the evening after service, thinking he will bring it back in the morning. You guessed it the next morning he was gone suit and all just walked out and left. Leaving me devastated losing my pride and joy and with a lesson learnt<br>As time passed, Alan was replaced by a young Italian head waiter named Joseph, who spoke English with an Italian accent and carried himself with confidence. With the completion of renovations in the cocktail bar and restaurant, we settled into a routine of providing meal service, though the trend of cooking at the table had diminished. During this period, the music and songs from the film/show My Fair Lady were immensely popular and played every night during food service. On our shared days off, Sheila and I arranged our schedules so we could spend three consecutive days together. This allowed us to visit our respective families; I would travel to Dover to see my mother, while Sheila would visit her father. We coordinated these trips with the consent of the management. During one of my visits home, upon returning to the Bull Hotel, I was informed by a housekeeper, who was aware of the close bond between Sheila and me, that something had happened to Sheila in my absence. She had informed Mr. Dixon of her decision to leave and was currently in her room, packing. Rushing to find her, I discovered Sheila in the lobby, awaiting her father to escort her home. It became clear to me that Joseph had taken advantage of her during my absence. On a couple of quiet nights, fueled perhaps by alcohol and the prevailing music of the time, Joseph had made inappropriate advances towards Sheila. Learning of this, I no longer felt comfortable staying at the Bull Hotel alone, especially with the prospect of continuing to work with Joseph. After discussing our options, Sheila and I decided to seek another live-in position elsewhere, using the services of the same agency we were familiar with. Sheila's father arrived, and after explaining our plans to him, he welcomed me to join them once I was free from my obligations at the Bull Hotel. He offered to transport Sheila's belongings, while she would follow him on their Lambretta. With the arrangements made, we bid farewell to the Bull Hotel, embarking on a new chapter in our lives.</p>\r\n</div>", "cover_image": "images/bull_hotel.jpg", "slug": "chapter-7", "created_at": "2025-06-29T10:49:14.322Z", "updated_at": "2025-07-03T07:24:55.765Z", "order": 8}}, {"model": "chapters.chapter", "pk": 38, "fields": {"title": "chapter 8", "subtitle": "<p>Stoke Green Cricket Club in Stoke Green has been playing there since 1879 with support of the then landowner, Howard-Vyse of Stoke Place.Stoke Poges Golf Club at Stoke Park used to run a cricket club in the early 20th century, playing home matches in Farnham Royal</p>", "content": "<div class=\"content\">\r\n<p dir=\"ltr\">I arrived at the Red Lion cottage after tendering my resignation at the Bull Hotel. The Red Lion Cottages were situated just outside Slough, in the quaint village of Stoke Green. The village boasted a pub, the Red Lion, a corner store, and eight cottages lined up together, each detached with beautiful, extensive gardens in front. Vines adorned some cottages, adding a charming ambiance I appreciated even as a teenager. Sheila&rsquo;s father lived in number 6, a cottage with a manicured lawn that resembled those found on bowling greens, flawless level and vibrant green, not a weed in sight. Henry Kelly, Sheila&rsquo;s father, was a gardener by profession, tending to the grounds of the Sir Howard Vyse Estate just across the road from the cottages. The estate boasted a splendid array of old oak trees and sycamores, with a vegetable garden teeming with produce of every variety. Henry was among the dedicated gardeners responsible for nurturing the horticulture on the estate, and many of the cottages&rsquo; occupants were fellow employees. Inside, the cottages were modern for their age, with small back gardens featuring the flourishing bushes of Forsythia in full bloom. Each cottage comprised a kitchen, a living room, an upstairs bathroom, and two bedrooms, all decorated and cozy. Sheila greeted me upon my arrival just after midday; she had prepared a delightful lunch. Henry soon joined us, and over lunch, we shared stories of our experiences and aspirations. I found an instant connection with Henry; his warmth and positivity uplifted both of us. And so, another chapter of my life begins, alongside someone I cherish, hoping our affection is mutual.</p>\r\n<p dir=\"ltr\">After living closer together, I felt it was the right time to propose to Sheila. Sheila accepted immediately, and the news delighted Henry. However, a serious condition required consideration: Sheila desired a church wedding, and raised as a strict Catholic, she required my conversion to Catholicism.</p>\r\n<p dir=\"ltr\">I can&rsquo;t recall if I mentioned in earlier chapters, but my father was of the Jewish faith. However, we never attended a synagogue, nor was I brought up in the Jewish religion. I remember that in my early school days, when Religious Education (R.E.) classes occurred, teachers removed me from the classroom for other lessons, like art or music.</p>\r\n<p dir=\"ltr\">After careful consideration, I accepted the challenge, so to speak. At the Bull Hotel, Sheila discovered a nearby monastery that held Mass, and I accompanied her a few times, finding the experience quite interesting. I then attended religious instruction classes twice a week for two months before being baptised into the Catholic Church. I&rsquo;ve never regretted it, although I wouldn&rsquo;t call myself a religious person&mdash;far from it. Still, those Sunday homilies help keep you on the straight and narrow.</p>\r\n<p dir=\"ltr\">We were<a href=\"../../../../media/gallery_images/Wedding_Day_0001_Edited.jpg\"> married</a> on November 27th, 1959, at St. Ethelbert&rsquo;s Church in Slough. It was a small wedding with my brothers Michael (my best man), Lionel, and Phillip, along with my sister Carol, a bridesmaid. Henry was there, as well as Sheila&rsquo;s aunt and uncle, and another cousin named Sheila, who was also a bridesmaid. After the small reception, we set off for our honeymoon in Cornwall. Henry was kind and lent us his car for the trip.</p>\r\n<p dir=\"ltr\">This brings me to another little story worth mentioning.</p>\r\n<p dir=\"ltr\">I had been driving since I was fifteen, but always on a provisional license. Henry&rsquo;s generosity in lending us his car made me feel it was only right to get my full license. So, I booked my driving test. The day arrived, and after completing the course with the examiner, we sat in the car as he prepared to give me my results.</p>\r\n<p dir=\"ltr\">He looked at me and said, &ldquo;Have you done your National Service yet?&rdquo;</p>\r\n<p dir=\"ltr\">I felt puzzled. &ldquo;No, sir,&rdquo; I replied.</p>\r\n<p dir=\"ltr\">&ldquo;Well,&rdquo; he said, &ldquo;it&rsquo;ll be a good thing when you do&mdash;they&rsquo;ll teach you the difference between left and right! I told you to turn left, and you turned right. I told you to turn right, and you turned left. But aside from that, I can&rsquo;t fault your driving. You&rsquo;ve passed.&rdquo;</p>\r\n<p dir=\"ltr\"><br>After taking some time for ourselves, it was time to seek employment. Our opportunity came as London Airport. We turned to the agency we had used before and found positions for both of us at London Airport, located not too far from Slough and accessible. London Airport comprised the Queens Building, which handled all domestic and continental flights, and London Airport North, a temporary facility until Heathrow Airport opened completely. The buildings at London Airport North were reminiscent of old wartime munition huts or buildings, with round roofs that sloped down to the ground like half-moons. Inside, there were lounges, restaurants, shops, and a cocktail bar. I found employment there, knowing it was temporary until they constructed proper facilities at Heathrow Airport. Back then, air travel was the exclusive domain of the elite: celebrities, politicians, and impeccably dressed business personnel. The seating areas offered an unrestricted view of the aircraft coming and going, including Constellations, Bristol Britannias, DC 9s, Boeing Stratocruisers, De Havilland Comets, and later, Boeing 707s. For me, seeing the well-dressed ladies with their lovely hats and gentlemen in their suits felt romantic. Working in the cocktail lounge, serving drinks, allowed me to engage in light conversation with the patrons, sparking my desire to travel. Sheila held a server position in the Queens Building cafeteria; I remained at London Airport North until its closure in 1959.<br>As the hands of time swept by, the depth of my feelings for Sheila grew stronger with each passing day. It was a realisation that led me to take a leap of faith and propose marriage.<br>To my delight, she accepted, and on the 26th of November 1959, we exchanged vows in a humble ceremony attended by only twenty cherished guests from each of our families.<br>Given Sheila&rsquo;s Catholic faith and her desire for our wedding to be celebrated in a Catholic church, I knew I would need to convert to Catholicism. Moving in with Sheila and Henry at Stoke Green, I completed a six- to eight-week instruction period with a Catholic priest, culminating in my baptism and formal entry into the Catholic Church. Growing up with no religious affiliation, I had always felt a vague sense of longing for some form of spiritual connection. In my youth, I had experimented with attending Sunday School gatherings, as well as trying out the Boys Brigade and Scouts, but I struggled to reconcile myself with the rituals and prayers involved. During our time working at the Bull Hotel, Sheila invited me to accompany her to Mass. Wanting to support her and strengthen our bond, I agreed. Near to the Bull Hotel was an old Friary Monastery at Aylesford, run by Carmelite friars. The monks, dressed in white cassocks, conducted the Mass in an austere chapel devoid of icons or plaques found in Catholic churches. These early morning Masses became a routine for us, offering me a glimpse into the Catholic faith. The instruction sessions were enlightening and engaging; I often engaged in-depth discussions with the Italian priest who oversaw my conversion. His perfect English, coupled with a charming Italian accent, left a lasting impression on me. Perhaps this experience sparked my love for Italian cuisine as I immersed myself in the culture.<br>While my time at the airport had been fulfilling, I knew it was time to spread my wings further. The hospitality industry, with its myriad facets, beckoned me to explore new horizons. Each establishment offered a unique tapestry of experiences, a canvas upon which I could paint the colours of my expertise and passion. As I contemplated the next chapter in my professional journey, I couldn&rsquo;t help but feel a sense of anticipation. What wonders awaited me in this ever-changing landscape of hospitality?<br>With Sheila still dedicated to her work at Pinewood Studios, the opportunity for us to embark on a new adventure presented itself as live-in positions at The White Swan Hotel in Stratford-upon-Avon for the summer. It was an offer too enticing to pass up, promising not only a change of scenery but also an opportunity to expand our repertoire in the realm of catering while bolstering our savings. We accepted the proposition, viewing it as a stepping stone towards our shared aspirations. Packing our bags, we prepared for the journey ahead. Thankfully, we still had the trusty Lambretta at our disposal, and with Henry&rsquo;s helping hand to load our belongings, we set off on the road to Stratford-upon-Avon. As the countryside rolled by, anticipation bubbled within us, mingling with a hint of nervous excitement. What adventures awaited us in this quaint town steeped in history and culture? Only time would reveal the treasures hidden within its cobblestone streets and timber-framed buildings. But one thing was certain: Sheila, and I were ready to embrace every moment of this new chapter in our lives.</p>\r\n<p>&nbsp;</p>\r\n</div>", "cover_image": "images/redlionCottages.jpg", "slug": "chapter-8", "created_at": "2025-06-29T10:49:14.342Z", "updated_at": "2025-07-03T07:24:16.061Z", "order": 9}}, {"model": "chapters.chapter", "pk": 39, "fields": {"title": "chapter 9", "subtitle": "<p>Stratford-upon-Avonthe home of William Shakespeare and theatre a market town with more than 800 years of history, containing not only many buildings that survive today and would have been familiar to Shakespeare, but also a thriving community offering a wide variety of leisure, accommodation and shopping experiences. So take a moment to have a look around the site!Web-Site.</p>", "content": "<div class=\"content\">\r\n<p>In those days, the convenience of hopping onto a computer or mobile phone to gather information was but a distant dream. Our knowledge of&nbsp;<a href=\"https://www.white-swan-stratford.co.uk/\" target=\"_blank\" rel=\"noopener\">The White Swan Hotel</a>&nbsp;in the heart of Stratford-upon-Avon was limited to its reputation as a distinguished four-star establishment. As we arrived at the hotel, our expectations were surpassed by the grandeur of the building, its architecture steeped in the rich tapestry of history, spanning over 800 years. The hotel boasted 40 lavishly appointed bedrooms and a dining room that exuded classic elegance. Upon our arrival, we were warmly welcomed by the owner and managers, who provided us with a brief overview of our duties. Soon after, we were introduced to the Maitre d, the esteemed head waiter, who would be our guide through the intricacies of service in the dining room. Our training commenced with meticulous attention to detail, as we familiarized ourselves with the rhythm and protocol of the dining room. My attire for the role was nothing short of formal, adorned in a full black tailcoat with a winged collar and a perfectly tied black bow tie. Sheila, too, was outfitted in elegant attire, donning a black dress complemented by a small white apron and a dainty white hat perched atop her head. Our station was meticulously arranged, comprising three to four tables, each capable of accommodating eight to twelve guests. We were entrusted with the art of silver service, a hallmark of refined hospitality that demanded precision and grace. As the evening unfolded, we embraced our roles with enthusiasm, eager to deliver an unforgettable dining experience to each patron. However, our accommodation arrangements provided a welcomed contrast to the grandeur of the hotel. We were to reside in a private home not far from the hotel, a cozy haven where we could retreat after the rigors of service.<br>As we settled into our new home away from home, it quickly became apparent that The White Swan Hotel was a hub for American tourists embarking on coach tours of Britain's historical landmarks. These travelers would grace our establishment for a brief two or three nights before continuing on their journey, making for a lively and ever-changing atmosphere throughout the summer season. Joining us in shouldering the workload were a couple of spirited young Irish lads, along with other local couples. Despite our disparate backgrounds, we found common ground and forged lasting friendships, often sharing convivial evenings out together. Sheila's Irish heritage served as a bridge, strengthening our bonds with our newfound companions. As time passed, we found ourselves parting ways with our beloved Lambretta, selling it to the Irish lads who had become more than just acquaintances. With our sights set on broader horizons and a desire for more extensive travel, we recognized the need for a more reliable form of transportation. In 1958/59, the advent of the Mini car presented an opportunity too good to pass up, and we eagerly placed an order for one. One late afternoon, as we were preparing for the evening service, the long-awaited vehicle arrived at our lodgings. Filled with excitement, I dashed down the stairs to meet the young lady representing the dealership, clad only in my shorts and a makeshift cardboard white dicky shirt front. In the world of service, where fresh, starched shirts were a luxury, the cardboard alternative served as a passable substitute beneath one's jacket. My impromptu attire elicited laughter from the young lady and our landlady, Mrs. Beasley, leaving me feeling both amused and slightly embarrassed. But in that moment, as laughter echoed through the halls, it was a reminder of the camaraderie and joy that colored our days at The White Swan Hotel.<br>Amidst the bustling days at The White Swan Hotel, our routines were defined by the cadence of service. Early mornings ushered in a flurry of activity as guests clamored for breakfast, eager to fuel themselves for a day of exploration. By mid-morning, the pace would ease as sightseers ventured out, leaving us with a brief respite before the lunchtime rush. Lunches were light affairs, tailored to the preferences of our predominantly elderly American clientele. The phrase \"pre-burials\" lingered in the air, a gentle reminder of the stage of life many of our guests found themselves in. As the afternoon waned, we would prepare for the evening service, a time when the dining room would come alive with chatter and laughter. Despite the demands of our roles, we carved out moments to explore the charms of Stratford. Afternoons were often spent by the banks of the river Avon, indulging in the quintessentially British tradition of afternoon tea. It was during one of these leisurely outings that we encountered Alan Baines, a familiar face from our past. Alan's presence stirred mixed emotions, his affable demeanor belying past grievances. Despite Sheila's reservations, we engaged in polite conversation, though the absence of gratuities served as a stark reminder of past transgressions. Evenings found us at the local fish and chip shop, savoring the simple pleasures of good food and camaraderie. The Irish boys, with their infectious energy, added an extra layer of merriment to our nights out. As the summer season drew to a close, we bid farewell to The White Swan Hotel and its cast of characters. Though sad to part ways, we cherished the memories forged during our time in Stratford. With fond farewells and promises to keep in touch, we embarked on the next chapter of our journey, grateful for the experiences that had enriched our lives.<br>We packed our belongings into our newly acquired Mini for our journey back to Stoke Green to rest and take some time off before our next engagement. However, things didn&rsquo;t go as planned. We were on the M1 motorway heading south, about halfway through the journey when our lovely little Mini let us down. I began to realize there was a problem while driving and pulled into the next layby. Not having a clue what had happened to our newly acquired vehicle, we were lucky there was an emergency phone in the layby. After some time, help arrived, and the Mini was towed to the nearest garage. Fortunately, we had a warranty as we had just purchased the Mini. In short, the Mini was repaired, but it took over five weeks to get the parts because they were so popular. The manufacturers were pushing them out to fill orders and not allowing for spare parts. In the end, we had to get in touch with Henry to pick us up, and our plans for a little traveling holiday were gone.</p>\r\n</div>", "cover_image": "images/whiteswan.jpg", "slug": "chapter-9", "created_at": "2025-06-29T10:49:14.362Z", "updated_at": "2025-07-03T07:23:30.052Z", "order": 10}}, {"model": "chapters.chapter", "pk": 40, "fields": {"title": "Chapter 10", "subtitle": "<p>WindsorIt&rsquo;s the largest and oldest inhabited castle in the world When William the Conqueror had Windsor Castle built in the late 11th century, it was to be an indestructible fortress. He built the castle to be strategically located on the Thames, while ensuring Norman dominance around London. At that moment, the royal family lived in the former palace of Edward the Confessor in the village of Old Windsor. Windsor Castle has been used as a royal residence in 1110 by Henry I (4th son of William the Conqueror). Since then, the castle has been the home of the British royal family, with no fewer than 39 monarchs residing there.</p>", "content": "<div class=\"content\">\r\n<p>Without the Mini to travel, we had to look for employment closer to Stoke Green. We found work in Windsor, which was very close. We tried three places there. The first one was The Old House, a hotel right on the border of Windsor and Eton. From the hotel, you could see the comings and goings of the Eton students. The hotel restaurant was primarily visited by the parents of the Eton boys. It was very stuffy and posh with the Mater and Paters visiting their sons at Eton College. Unfortunately, we didn&rsquo;t stay long at The Old House. I don't think the existing staff took to me as they had always had waitresses there. One waitress, who thought she was in charge, tried ordering me around and upsetting me. When she saw it wasn't working, she went after Sheila, making our time there unbearable. We didn't need to put up with such nonsense, so we left after one month, telling management why and suggesting they do something about the said waitress. Sheila went to the Castle Hotel in Thames Street, and I went to The Grapes Restaurant in the same street. The new owners wanted to uplift the status of the premises and turn it into an upmarket dining experience. With my training at The Bull, experience cooking at the table, and working at the airport cocktail bar, how could these new owners refuse me?<br>Mr. and Mrs. Boyes, the new owners of The Grapes, were a great couple, but it soon became clear that this was their first foray into the catering business. Working at The Grapes was a real challenge due to its very small dining room, which had only about 10 to 12 tables. When you entered The Grapes from Thames Street, you first encountered a public bar. As you moved further in, you came across a lounge with a well-equipped cocktail bar. Climbing a set of stairs brought you to the dining area. The kitchen was located downstairs, and there was a lift that connected the kitchen to a pantry off the dining room. The kitchen was managed by a chef from Hungary, and communication with the kitchen was via speakers at each end. As you can imagine, service time presented obstacles, especially when trying to convey certain messages. The chef's understanding of requests and the crew's understanding of his accent often added to the challenge. At the side of the building, there were stairs leading down to the kitchen&mdash;stairs my patrons were unaware of. These stairs were a lifeline, allowing me to deliver the kind of service I aimed to establish in the newly opened Grapes fine dining room. As time went by, we managed to build a small following. Given The Grapes' location on Thames Street opposite Windsor Castle, we received many walk-ins during the summer season<br>Sheila stayed at The Castle Hotel for as long as she could, but once it became clear she was expecting, she reluctantly gave notice. They were sad to lose her and her lovely personality but wished her well for her upcoming confinement. Sheila quickly grew bored of staying at home and ended up joining me at The Grapes. She assisted in the pantry, out of sight of customers. We had a great time together and with the other employees, sharing many laughs. Eventually, the day came when Sheila could no longer work, but we were both thrilled with the anticipation of our child's arrival. We didn't know at the time, but our baby boy was on his way.What an amazing day that was for both of us and Henry! The anticipation had been building up for months, and finally, on January 27, 1961, our first child, Paul, arrived. The moment we saw him, all the anxiety and restlessness melted away, replaced by overwhelming love and joy. Holding Paul for the first time, we knew our lives had changed forever.<br>Sheila was radiant, despite the exhaustion, and Henry was beside himself with excitement. The room was filled with smiles and tears of happiness, and we couldn't stop marveling at the tiny new life we had brought into the world. The early days were a whirlwind of sleepless nights, diaper changes, and first smiles, but they were some of the best days of our lives.</p>\r\n</div>", "cover_image": "images/Windsorcastle.jpg", "slug": "chapter-10", "created_at": "2025-06-29T10:49:14.382Z", "updated_at": "2025-07-03T07:22:45.871Z", "order": 11}}, {"model": "chapters.chapter", "pk": 41, "fields": {"title": "Chapter 11", "subtitle": "<p>Herne Bay is a seaside town on the north coast of Kent in South East England. It is 6 miles (10 km) north of Canterbury.The town rose to prominence as a seaside resort during the early 19th century after a group of London investors built a pleasure pier and promenade, and it reached its heyday in the late Victorian era.</p>", "content": "<div class=\"content\">\r\n<p>The situation had become too volatile. Regrettably, our little bubble burst, and we had to find a new place to live. This left me in an awkward position as I needed to appease Sheila while also finding suitable accommodation. Unfortunately, the rents where we were located were exorbitantly high, making it impractical to stay. With that, we expanded our search and found a location within our budget in Herne Bay on the Kent coast.</p>\r\n<p>&nbsp; &nbsp; &nbsp; I then needed to arrange an interview with my superiors at the post office to explain my situation and request a transfer to the nearest GPO depot to Herne Bay. Their initial reaction was less than enthusiastic. They expressed discontent, citing the time and money they had invested in training me for their area, which they feared would not yield a return.<br>&nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; After about 10 days, I was called into the GPO offices, where they reluctantly agreed to let me go and transfer me to the Canterbury depot. However, this meant starting over with a gang again. I expressed my reluctance but explained that I felt I had no choice as our living arrangements were becoming untenable for my wife and son. As winter approached, we decided to move out. With the help of a mover, we transported our few possessions from the cottages to our new rental, an apartment situated right on the seafront. It was on the second floor, and it boasted splendid views of the sea, albeit accompanied by gusty winds and chilly temperatures.<br>&nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; During our time there, we primarily inhabited the kitchen and bedroom, reserving the lounge area for storing our food since we didn't own a refrigerator, making the space too cold for extended stays.<br>&nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; Commute to the Canterbury depot from Herne Bay involved catching a bus departing at 5:45 in the morning, ensuring my punctuality for the 7:30 start. Following the instructions from my superiors in Slough, I integrated into a group of men, starting afresh to demonstrate my capabilities and dedication to the work. Eventually, I earned their acceptance, although it came with disappointment as my pay rate decreased.<br>&nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; Despite the chilly climate, there were positives to our new location. We found solace in the nearby Catholic church, where we often attended mass, pushing Paul in his pram along the promenade on sunny days. Additionally, having Brother Lionel reside in Canterbury brought us joy through his frequent visits. These occasions provided opportunities to reconnect and even introduced us to June, his wife, who was a school teacher. Sheila shared the exciting news with me that she was pregnant, and we were expecting an addition to the family around May.</p>\r\n<p>Knowing this and realising that our lease on the apartment would soon expire, and with the prospect of a rent increase for the summer season looming, we felt compelled to explore other housing options. Determined to find a more permanent solution, I began familiarizing myself with the area and neighboring towns, actively searching for alternatives that would better suit our needs.&lt;<br>&nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; While scanning rental advertisements, I stumbled upon an intriguing offer aimed at assisting individuals in purchasing their own homes. Intrigued, I contacted the advertiser and discovered that the Canterbury City Council was approving home loans for eligible applicants. This revelation prompted a shift in my mindset from longing for a rental to considering the possibility of homeownership.<br>&nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; After discussing the offer with the representative, we established a budget within which we could comfortably purchase a house. To my delight, I found a terraced home located at 2 Albion Place, just two streets away from Canterbury Cathedral, listed at &pound;19,000. Following the representative's suggestion, I made an offer of &pound;18,000, which was accepted quite a pleasant surprise!<br>&nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; With the assistance of our modest savings and a mortgage at a low interest rate, we were able to enter the property market and secure our own home. After completing all the necessary legal procedures and signing away what felt like my life, I officially became a homeowner. Our new residence was 2 Albion Place, nestled in a quiet cul-de-sac just a stone's throw away from the bustling city of Canterbury. This terraced house, dating back to the 1890s, boasted three bedrooms and a recently constructed bathroom with a toilet and an extension that modernized the home.<br>&nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; On the ground floor, we found a spacious front room, a large kitchen with a scullery adjacent to it, and a small back garden featuring the customary outdoor WC typical of homes from that era. While the condition of the house wasn't flawless, the front bedroom upstairs required some attention. we could overlook this for the time being, as it wasn't immediately necessary for our use. The layout posed a slight inconvenience, as accessing the bathroom required passing through the third bedroom, but it was a minor inconvenience in the grand scheme of owning our piece of property, assuming we could keep up with the mortgage payments, of course. <a title=\"Canterbury\" href=\"core\\media\\images\\canterbury.jpg\">&lt;h2&gt;Canterbury&lt;/h2&gt;</a><br><a title=\"Canterbury\" href=\"core\\media\\images\\canterbury.jpg\">&nbsp; &nbsp; &nbsp; &lt;div class=\"responsive-picture picture\"&gt;</a><br><a title=\"Canterbury\" href=\"core\\media\\images\\canterbury.jpg\">&nbsp; &nbsp; &nbsp; &nbsp; &lt;picture&gt;</a><br><a title=\"Canterbury\" href=\"core\\media\\images\\canterbury.jpg\">&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &lt;img alt=\"Placeholder Picture\" width=\"1920\" height=\"1199\" src=\"./images/canterbury.jpg\" loading=\"lazy\"&gt;</a><br><a title=\"Canterbury\" href=\"core\\media\\images\\canterbury.jpg\">&nbsp; &nbsp; &nbsp; &nbsp; &lt;/picture&gt;</a><br><a title=\"Canterbury\" href=\"core\\media\\images\\canterbury.jpg\">&nbsp; &nbsp; &nbsp; &lt;/div&gt;</a><br><a title=\"Canterbury\" href=\"core\\media\\images\\canterbury.jpg\">&nbsp; &nbsp; &lt;h3 class=\"subtitle-section\"&gt;</a>Canterbury, a cathedral city in southeast England, was a pilgrimage site in the Middle Ages. Ancient walls, originally built by the Romans, encircle its medieval centre with cobbled streets and timber-framed houses. Canterbury Cathedral, founded 597 A.D., is the headquarters of the Church of England and Anglican Communion, incorporating Gothic and Romanesque elements in its stone carvings and stained-glass windows. &lt;/h3&gt;<br>&nbsp; &nbsp; &lt;p class=\"paragraph body-paragraph-tutorial\"&gt;After settling into our new home over the course of several months, and with a reduction in my wages at the post office, it became apparent that to meet our financial needs and obligations, I would need to supplement our income. Drawing on my catering experience, I embarked on a mission to secure part-time work at the various hotels in Canterbury, specifically aiming for positions in their restaurants that offered evening, weekend, and public holiday shifts.<br>&nbsp;&nbsp;<br>&nbsp; &nbsp; Despite facing several rejections, I eventually secured a part-time waiter position at the Slatters Hotel, which provided the additional income we required. &lt;a href=\"images/Slatters-Hotel-postcard-Canterbury.jpg\" target=\"_blank\"&gt;The Slatters Hotel&lt;/a&gt; was particularly busy, especially during the summer months, resulting in my part-time hours extending to nearly every night, weekend, and public holiday. Understandably, this schedule became overwhelming for Sheila to manage on her own.<br>&nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; As the time for our baby's arrival drew nearer, Sheila received the news that the baby was due in just a few weeks. Given our decision for a home birth, we were visited by the local midwife, whose arrival coincided with one of her scheduled visits. It was during this visit that Sheila's water broke unexpectedly right at the front door, marking the beginning of our daughter's journey into the world.<br>&nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; Julia was born on the 12th of May, 1962, right in our home at 2 Albion Place. I returned from work to the joyous news of becoming a father to a beautiful daughter.&lt;br&gt;Our household possessions were very sparse, and we were in need of several appliances: a fridge, washing machine, and dryer. In fact, we lacked many things that would make a comfortable home. Now, we have two lovely children, gifted to me and Sheila. It became my responsibility to care for them. Even with my part-time work, acquiring the funds we needed was a slow process.&lt;br/&gt;</p>\r\n<p>&nbsp; &nbsp; Lionel visited us regularly. He had a job with the West Piling construction firm. How he obtained such a position is beyond me; as far as I know, he was a petty officer in the catering department of the Royal Navy. Nonetheless, he repeatedly urged me to join him, promising considerable pay increases compared to my current income. When I inquired about the amount, he mentioned it would likely be double what I was earning at the time. Naturally, I asked what the catch was. His response was that we would have to travel to different sites daily until our assigned tasks were completed. Currently, the job was at the &lt;a href=\"../MyStory/images/dungenesspower.jpg\" target=\"_blank\"&gt;Dungeness Power Station&lt;/a&gt;. Lionel assured me he would provide transportation and cover the cost of travel.&lt;br/&gt;Knowing nothing about construction, I understood that we would be working as laborers for a flat rate of &Acirc;&pound;20, with additional compensation for travel time and overtime. This seemed like significant money, especially considering that my current income at the GPO was &pound;12 per week, and I earned &pound;1.50 per hour at my part-time job. However, accepting Lionel's offer would mean giving up my career at the GPO in telecommunications.&lt;br/&gt;What do you do when your family needs the comfort and security of a home with the amenities they deserve? I found myself grappling with this question. I approached my superiors at the GPO and requested a pay raise, hoping to better provide for my family. However, my request was swiftly denied without consideration.</p>\r\n<p>&nbsp; &nbsp; In their stead, they suggested I enroll in night school and study for the Elementary Telecommunications Practice exam. Passing this exam would elevate me to a higher pay rate, but the course would take 12 to 18 months, with no guarantee of success.&lt;br/&gt;<br>&nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; Over the next few days, Sheila and I deliberated Lionel's offer. Sheila astutely reminded me that I had left the hospitality industry to be present at home during evenings, weekends, and public holidays. Her point resonated deeply with me. Thus, with a heavy heart, I made the difficult decision to tender my resignation to the GPO and join Lionel's team.&lt;br/&gt;&lt;br/&gt;As Lionel had informed me, we were assigned to work at the Dungeness Power Station, a duty that lasted for many weeks. Our mornings began early, with a one-hour drive to reach the station. Despite the long hours, I was grateful to be back home in the evenings. Some Saturdays offered overtime opportunities, which we eagerly seized, but we always cherished Sundays and public holidays spent with our family.</p>\r\n<p>&nbsp; &nbsp; Our task at the station involved arranging templates for the bases of the large pylons that would eventually carry power to the national grid.<br>&nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; During the Easter holidays, we organized Julias baptism, anticipating the arrival of visitors from Sheila's hometown of Blackburn Auntie Kitty and Uncle Bill, who graciously agreed to be Julias godparents. Recognizing our limited space, they stayed at Slatters Hotel instead of with us at 2 Albion Place. Despite our humble accommodations, we did our best to extend hospitality with whatever resources we had at the time, even though I had only recently started working at the power station.&lt;br/&gt;<br>&nbsp; &nbsp; Having family around us was a joy, and Kitty and Bill were delightful guests. However, Sheila later mentioned that Kitty had not been impressed with 2 Albion Place, which left a lasting impression on me.&lt;br/&gt;We continued to work at the power station for several months. It was certainly an eye opener to be working on such a large project. With working at the power station it really helped with my cash flow and we were able add to our comfort in the home. &lt;br/&gt;After the working at the power station we had a new assignment which took us to the outer suburb of London which was about another 30 mins to our travelling time. Lionel was still our transport, but things were getting a little disjointed&nbsp;<br>&nbsp; &nbsp; As Lionel was become unreliable by picking the team up late which made us late for signing on in the mornings and one day running out of petrol on the motorway. With each one of us showed our disappointment with him he told us that he has had enough of this job and is going leave.&lt;br/&gt;Of course, this situation left me very upset and unsure of what to do next. In hindsight, I should have seen it coming, but at the time, I felt I had burned my bridges with the Post Office. Returning to Slatters Hotel was not an ideal solution for me, as I was unhappy about giving up my position at the Post Office, despite the financial benefits. Ultimately, I made that choice for the money and for the well-being of my family.</p>\r\n<p>&nbsp; &nbsp; In search of some clarity, we decided to visit Mum at clare House in Dover. During our conversation, she mentioned that the cross-channel ferry company I previously worked for had a new ship launching this summer and was looking for crew. I made a few inquiries with the company, and they were open to me applying for a position on the new ship.<br>&nbsp;&nbsp;<br>&nbsp; &nbsp; Now, the challenge was that we were living in Canterbury. Mum and I also discussed a new housing development in Whitfield, just a couple of miles away from her place. We decided to check it out and found semi-detached, low-set houses for sale. If we could sell our home in Albion Place, there was a possibility we could afford one of these new houses, as the prices were manageable.&lt;/p&gt;</p>\r\n</div>", "cover_image": "images/hernebay.jpg", "slug": "chapter-11", "created_at": "2025-06-29T10:49:14.410Z", "updated_at": "2025-07-03T07:22:04.932Z", "order": 12}}, {"model": "chapters.chapter", "pk": 42, "fields": {"title": "Chapter 12", "subtitle": "<p>Hospitality, I realized, could be an unsociable trade, with long hours spent working evenings, weekends, and public holidays. Seeking a more stable and fulfilling career path, I started exploring other options.</p>", "content": "<div class=\"content\">\r\n<p class=\"paragraph body-paragraph-tutorial\">I eventually came upon an advertisement for a career opportunity at the Post Office, focusing on telecommunications. After attending several interviews, I was fortunate to secure a position as a trainee at the telephone service of the UK General Post Office. Leaving my job at the Grapes was bittersweet; while I had formed strong bonds with Mr. and Mrs. Boyes, they understood the transient nature of the hospitality industry, where gaining diverse experience often means moving on.<br><br>Upon starting my employment, I found myself part of a team of men, traveling in a well-equipped vehicle laden with various tools and equipment. Our primary responsibilities included installing telegraph poles and telephone kiosks, as well as repairing lines damaged by storms. Clad in excellent work attire, I relished the opportunity to work outdoors, despite the physical demands of our tasks. My colleagues, a group of down-to-earth individuals, differed greatly from those I had encountered on ships and in hotels. However, I quickly assimilated into their camaraderie and was eventually accepted as one of their own. My time with this team served as an observation period for my work ethic and demeanor. After six months, I was selected to attend a ten day course at&nbsp;<a href=\"https://www.britannica.com/place/Bletchley-Park\" target=\"_blank\" rel=\"noopener\">Bletchley Park,</a>&nbsp;focusing on the fundamentals of telephony.<br>Although it was challenging for Sheila, my absence was punctuated by weekend visits home.<br>The photo at the top of the page, showing men strapped into the top of a telegraph pole, brings back memories of a rather amusing exercise. The aim was to simulate working on wires and insulators by strapping oneself in and leaning out. However, in reality, the process of climbing several meters and securing oneself was quite different. I vividly recall my own experiences, including one where I scaled heights of over 60m, such as those along the seafront in Herne Bay, Kent. Especially in the chilly winter weather, it was an adventure that left a lasting impression.<br>Upon completing the course, I was assigned to a smaller team, comprising four men and a foreman, tasked with installing wires between telegraph poles. Fresh from my training at Bletchley Park, I eagerly took on the responsibility of climbing poles to connect wires. I cherished our outings into the countryside, where we enjoyed makeshift picnics during breaks, brewing hot tea and sharing meals.<br>Subsequent to another six-month stint, I returned to Bletchley Park for further training, this time delving deeper into the workings of telephony and equipment installation. Following this, I joined yet another team, this time focusing on wiring from telegraph poles to buildings where telephones were to be installed. Within weeks, I found myself installing telephones in various locations, relishing the opportunity to interact with homeowners and business proprietors, and finding a sense of fulfillment in the creative process.<br>After several months of working with a gang on installations, I was offered a position as a solo fitter. In this role, I would be equipped with a bag of tools and apparatus and tasked with independently installing telephone extensions at various premises. Additionally, a vehicle was provided for me.<br>However, before I could take up this position, I needed to have a valid driving license. I otained the driving test just the previuos year year After completing a driving test, the instructor remarked on an amusing incident: I had mistakenly turned left when asked to turn right, and vice versa. Despite these nervous errors, the instructor commended my overall driving ability and passed me.So obtaining the license marked another milestone in my journey towards becoming a solo fitter with the GPO (General Post Office).<br>Life was going well; I was enjoying my new career, while Paul was growing up as a contented baby, looked after by Sheila, who also prepared delicious meals for us all.<br>Despite starting at the bottom of the pay scale at GPO and taking a significant pay cut, we managed decently without having to pay rent. However, we handled all the food shopping and utilities ourselves, managing to save a little along the way.<br>But then, something happened that disrupted our peaceful life. To this day, I'm unsure of the exact cause. Sheila and her father, Henry, had a falling out. Being caught in the middle of two stubborn Irish individuals who refused to give in was challenging. My loyalty naturally lay with Sheila, and after three to four weeks of tension, it became clear that staying at Red Lion Cottages was no longer feasible.</p>\r\n<div class=\"rule rule-section\">&nbsp;</div>\r\n</div>", "cover_image": "images/poles_450.jpg", "slug": "chapter-12", "created_at": "2025-06-29T10:49:14.428Z", "updated_at": "2025-07-03T07:21:25.248Z", "order": 13}}, {"model": "chapters.chapter", "pk": 43, "fields": {"title": "Chapter 13", "subtitle": "<p>SS Australis takes to sea bound for Auckland NZSS America was sold to Chandris Lines on October 5, 1964, and was handed over 12 days later when she was transformed externally with her funnels pained blue emblazoned with the famed Chandris large white X. On the same day the America was renamed Australis. With the Greek flag flying from her stern, she departed New York on November 18, to the Chandris Shipyards at Piraeus to be converted to a liner for the UK to Australia and New Zealand service. Her accommodations were substantially increased now accommodating 2258 passengers in an all Tourist Class configuration. In addition both Upper and Main Decks were extended aft, replacing several Tourist Class lounges with cabins. In addition her hull was pained white with a blue ribbon</p>", "content": "<div class=\"content\">\r\n<p>Receiving the letter from Sitmar Travel Agency in July 1966 was a pivotal moment for us. The offer of berths for our entire family on the SS Australis departing from Southampton on January 26th, 1967, was the opportunity we had been waiting for. Without hesitation, we accepted the offer and immediately began putting arrangements in place to prepare for our departure. Firstly, we set the wheels in motion to sell our house, ensuring that everything would be in order by the time of our departure. We also gave notice to Townsend Ferries, making arrangements for our departure from my current employment. And of course, we shared the exciting news with our family, preparing them for our upcoming journey. With everything falling into place, our anticipation and excitement for the adventure ahead grew with each passing day. We were ready to embark on this new chapter of our lives and embrace the opportunities that awaited us in New Zealand.<br><br>The day before our departure from the UK we stayed at our mother. In the afternoon I went down to the Dover Priory Railway station to confirm the times and to pay for the train journey to Southampton we need to arrive at Southampton no later than 4:30pm. I booked a taxi for morning trip to the station for all &amp; luggage in time for the train to London. Having completed this task we went home to spend the last hours with our family. In the morning there were very mixed emotions when saying our good byes. The children were seemed confused as normally they did not get this much attention! Maybe Paul was more switched on to it anyway it was very emotional. We arrived at the station on time for the train to London Charing Cross where we would get the connection to Southampton to arrive on time.<br>However when we all arrived with lots of luggage in informed the porter what we are doing he replied well this train is going to London but Cannon Street not Charing Cross. You can imagine how I felt this first stage of immigrating NZ. I was livid that I was told misinformation and paid for all us to Southampton. Anyway the station master was very apolegetic he sorted the times out and will have a taxi waiting for us to get us to Charing Cross in time for the connection to Southampton.<br>On our journey to Cannon Street, at each stop, a British Rail employee would find us on the train to reassure us that the taxi would be waiting to take us to Charing Cross station. Thanks to their assistance, we made it to Southampton on time for boarding the ship.<br>As we walked up the gangplank, an officer greeted us, asked for our names, found us on his list, and gave us our cabin number. He informed us that a crew member would show us the way to our cabin. The crew member who assisted us spoke little English, and from his attempts to communicate, I gathered that it was his first day on the Australis. In fact, it was the first day for most of the crew.<br>We later learned that the Chandris Company had changed the registration of the Australis to Panama. Previously, it was registered in Piraeus, Greece, and as a result of the change, all the Greek crew had walked off the ship, refusing to sail under a Panama flag. This explained why so many of the crew were new and still finding their way around.<br>We found our cabin, which was quite roomy, complete with a bathroom and toilet. Our bags arrived, but we decided to leave them unpacked for the moment. Instead, we headed to the upper deck where everyone was gathering for our departure. Colored streamers fluttered in the wind, and a band played music that we couldn't quite make out. Everyone on the ship was waving and shouting messages to people on the shore, who were doing the same in return. It was a thought-provoking moment&mdash;we were now on the ship we had been waiting for all these years, about to embark on a long journey from the UK. It hit me that we were leaving our family behind, not knowing when we would see them again. I felt the weight of responsibility for Sheila and our four children, hoping I had made the right decision for all of them. With the excitement of the departure behind us, we explored the ship and talked to the children, reassuring them and explaining what was happening. As we walked around, I spotted the young lady from the travel agency where we bought our tickets. She had been offered a berth to Piraeus to gain firsthand knowledge of the Australis to better sell future voyages. Seeing her on the ship gave me a sense of reassurance that I had made the right decision, although I could not quite explain why. Despite this comforting encounter, I never talked to Sheila about my feelings. Instead, I kept my thoughts to myself, focusing on ensuring our family settled in and adjusting to our new life at sea.<br>From Piraeus, we sailed through the Suez Canal, one of the last ships to pass through before the war between Israel and Egypt. Our next destination was Fremantle, the port for Perth, Australia, a journey that took about three weeks at sea. After Fremantle, we headed to Melbourne and then to Sydney, stopping at each port for a couple of days. Leaving Sydney, we crossed the Tasman Sea to Auckland, New Zealand, a crossing that took nearly five days. We finally disembarked on the 6th of March, 1967. The journey itself was long but filled with anticipation. The passage through the Suez Canal was particularly significant, given the geopolitical tensions at the time. Each port we visited offered a brief respite and a glimpse into the diverse landscapes and cultures of Australia. Fremantle was our first taste of Australian soil, and the sense of reaching a new continent was both thrilling and surreal. Melbourne's vibrant cityscape and Sydney's iconic harbor left lasting impressions, but it was the crossing of the Tasman Sea that truly tested our patience and resilience. As we neared Auckland, the excitement within our family was palpable. We had finally arrived in the country that would become our new home. The date, 6th March 1967, is etched in my memory as the beginning of a new chapter in our lives. Despite the uncertainties and challenges ahead, stepping off the ship in Auckland felt like a moment of triumph and hope for the future.<br>After going through the immigration formalities, we were welcomed to New Zealand by a person with whom I had been in touch through a friend of a friend. He had kindly arranged to meet us and transport us to a rental house that he had secured for us. All these arrangements were made through correspondence over the preceding months. His warm welcome and assistance made the transition smoother and reassured us that we had support in our new home.</p>\r\n</div>", "cover_image": "images/SS-Australis.jpg", "slug": "chapter-13", "created_at": "2025-06-29T10:49:14.448Z", "updated_at": "2025-07-03T07:20:39.791Z", "order": 14}}, {"model": "chapters.chapter", "pk": 44, "fields": {"title": "Chapter 14", "subtitle": "<p>Auckland in the 1960sAuckland, is based around 2 large harbours, is a major city in the north of New Zealand&rsquo;s North Island. In the centre, the iconic Sky Tower has views of Viaduct Harbour, which is full of superyachts and lined with bars and cafes. Auckland Domain, the city&rsquo;s oldest park, is based around an extinct volcano and home to the formal Wintergardens. Near Downtown, Mission Bay Beach has a seaside promenade</p>", "content": "<div class=\"content\">\r\n<p>After settling into our New Zealand home, we explored the local area and discovered some lovely places with charming names: Takapuna, Mairangi Bay, Milford, Glenfield, Northcote, Birkenhead, Beach Haven, and Devonport, and great beaches all located on the North Shore.<br>What really stood out to us was the age of the cars. We hardly ever saw any latest models; most of them were at least 20-30 years old. The one I drove on the day of our arrival was an old Ford, but I wasn't complaining as it was great to have such transport provided for us.<br>One of my first tasks was to secure employment. While working on the ferries, I had met a family on holiday from New Zealand who managed a hotel and restaurant in Takapuna. I mentioned to them that I was planning to move to New Zealand with my family, and they kindly gave me their contact details, encouraging me to get in touch when I arrived. Additionally, I had written to Air New Zealand about my intended arrival and received a reply asking me to contact them upon my arrival.<br>I followed up on these employment contacts and started working a week after our arrival in the cocktail bar and restaurant at The Mon Desir Hotel, situated adjacent to Takapuna Beach. I also went for an interview with Air New Zealand personnel and was informed that I would be notified of the date for the next intake of cabin crew.<br><br>Paul, Julia &amp; Kathryn were enrolled in the local primary school, as Phillip was to young he stayed at home, good company for Sheila in those early days. We settled into a routine that included work, school, and exploring our new surroundings. We enjoyed the beautiful beaches and parks, taking the children out for picnics and walks along the coast. The weather was pleasant, and the scenery was breathtaking, making our transition to New Zealand feel like a dream come true.<br>I have to mention this unexpected event that happened a few days after our arrival in New Zealand. My family and I were walking along Takapuna High Street when a couple approached us. As they got closer, I turned to Sheila and remarked that they looked very familiar. Sheila let out a surprising gasp and said they were the postmaster and his wife from the Whitfield post office, where we had drawn the children&rsquo;s welfare benefits from the UK government. I had been at their post office just weeks before we left.<br>We stopped and talked about our voyage to New Zealand, and they told us they were on vacation visiting family. It was quite an event to meet people who lived so close to us back in the UK, and now we meet on the other side of the world.<br>We received some good news via a letter from our solicitor in Dover: the sale of our house was completed, and the remaining funds were deposited into our New Zealand bank account, which I had opened before leaving the UK. With this financial assurance, we decided to import a new vehicle into New Zealand. In those days, you had to apply for an import license and demonstrate that you had overseas funds to purchase a new vehicle. I was hoping to create a small profit from the import, which would go towards buying a new home.<br>In late July, I received notification from Air NZ that the new intake for the training school would begin in August 1967. I was scheduled to attend a preliminary induction day, and if that went well, I was to be prepared to start the training school on August 14th.<br>I completed the six-week training school and passed, marking the beginning of my flying career as flight crew. At that time, Air NZ, often referred to as \"Air England\" due to the majority of the cabin crew coming from the British Merchant Navy, was based in Auckland. We flew all around the South Pacific, including Australia, Singapore, Hong Kong, and the USA. Air NZ had personnel based in LA who handled the Honolulu to LA leg, with passengers going on to London typically flying with BA.<br>Our time away from home was relatively short, with the longest trips being a week away. Most of our flights were twice a week, allowing for three or four-day stopovers in most destinations. However, our weekly flights to Tahiti included a week-long stay in a tropical paradise&mdash;truly an unbeatable experience, especially while being paid to do it!During my first year with Air NZ, we imported a new car and managed to sell it, which allowed us to purchase a block of land, known as a section in New Zealand. With the help of the NZ government, we were able to obtain a low-interest loan to build a house on the section. When we constructed our house, we intentionally included a bedroom and bathroom for Henry to reside with us. Given my employment with an airline, my family and I had access to discounted fares, which allowed us to extend the opportunity to Henry to come and live with us in New Zealand.<br>Although he initially arrived with a sense of discontent, having experienced something troubling in the UK, we respected his privacy and never pressed him to discuss it. After 6-8 weeks, Henry started to go out on his own and visit Takapuna. Gradually, he began to get back to his old self, which was great for all of us. Though he was never ungrateful, he still had a lot of time for the children. One day, he came back and told us he had managed to get a job and had met a lady he was going on a date with. We were so excited for him; he really deserved some positivity in his life. Sheila&rsquo;s mother had passed away suddenly from cancer in 1954, so Henry had been on his own for all this time.<br>Thanks to the affordable fares provided for the families of airline employees, we were able to invite my mother to stay with us at our first home on Gordon Avenue, and later at Becroft Drive, which I will discuss further in this saga. The first visit was particularly special as Sheila was pregnant with our child, Carolyn, who was born on November 26, 1970. My mother was a tremendous help during this time. With my unpredictable flying schedule, it was challenging to take time off, especially since I never knew when the big moment would arrive. Fortunately, I was home that day, and I remember it vividly. It was a Thursday. I had just returned from a day trip to Fiji that morning. Sheila went into labor later that evening, and thankfully, my mother was there to support her along with the other children. The weather was dreadful; it had been pouring rain all day. At that time, I was driving a 1949/50 Ford Prefect, and since the driveway of our new home wasn&rsquo;t fully completed, I couldn&rsquo;t get the car onto solid concrete. We tried several times to drive up, but the car kept slipping in the mud as Sheila's labor pains intensified. In a moment of urgency, I dashed to the top of the driveway and noticed a vehicle parked nearby on Gordon Avenue. I knocked on the door relentlessly until someone answered. I explained the situation, and we quickly got into their vehicle, which we used to reverse down to our concrete drive. Once we got Sheila into the car, I called the hospital to inform them we were on our way. Remarkably, Carolyn was born within an hour of our arrival, and she was warmly welcomed by all of us. This was one of the happiest times in my life,<a href=\"http://127.0.0.1:5500/images/family.jpg\">My family 1970</a>-surrounded by my family in our first NZ home:Sheila, my mother, Paul, Julia, Kathryn, Phillip, and our (KIWI) newborn, Carolyn.<br>There was an incident I need to discuss that occurred about ten days before Carolyn's birth. It was a lovely sunny day, and I was off work for a couple of days while Henry had gone to his job. We decided to pack a picnic and head to the beach. Upon arrival, we found a beautiful sheltered spot, and the children ran straight into the sea. A gentle breeze was blowing in from the ocean, making it a delightful day to enjoy the sunshine together. However, about thirty minutes later, I noticed a crowd gathering as the waves began to wash in more forcefully. Suddenly, I spotted a body lying in the sand and quickly jumped up to investigate. It was Phillip; he had been caught by the heavy waves and had stopped breathing. Thankfully, due to my training with Air New Zealand, I knew how to perform mouth-to-mouth resuscitation. As I worked to revive him, I noticed that everyone around was just standing and watching. I shouted for someone to call an ambulance. After several attempts, Phillip finally came around, and shortly after, an ambulance arrived to take him to the hospital. He was kept there for five days and underwent several chest X-rays before being discharged when everything was clear. I vividly remember visiting him in the hospital, where the nurse in charge of the ward gave me a stern talking-to. She criticized me for not being more responsible in watching my children, especially near the water. Even now, I still have nightmares about that day, and I recognize that the nurse had every right to address my negligence. I would never allow anything like that to happen again.<br>After that, everything settled down. Mum returned to the UK after being with us for several weeks, and her absence was deeply felt. The children started school: Paul attended Rossmini College, Julia went to Carmel College, and Kathryn joined Julia later after finishing primary school. A few years later, Phillip also joined Paul at his college. My career with Air New Zealand was progressing well, and I was promoted to Senior Steward. In this role, I was responsible for looking after all the passengers and flight crew in the economy section of the plane. Sheila kept busy with the children, of course, and whenever she could, she brought out her knitting machine. This hobby eventually blossomed into the business known as Magner Knitwear. This development leads me into the next chapter of our lives: the creation of Magner Knitwear</p>\r\n</div>", "cover_image": "images/auckland.jpg", "slug": "chapter-14", "created_at": "2025-06-29T10:49:14.469Z", "updated_at": "2025-07-03T07:19:46.236Z", "order": 15}}, {"model": "chapters.chapter", "pk": 45, "fields": {"title": "Chapter 15", "subtitle": "<p>Starting Magner Knitwear</p>", "content": "<div class=\"content\">\r\n<p>After the first year or so, we completed the retaining walls, which was a condition of our mortgage requiring us to install a wall along the length of the driveway. The surrounding garden was laid out and finished with the help of Henry, who was one of the gardeners at a royal estate in Wrexham, Bucks, UK. Anything he planted just thrived. I remember one time he came home with what appeared to be a bundle of dead twigs. He planted them in a row in the front garden, and within a few months, we had beautiful flowering azaleas that grew into a lovely hedge. With the garden completed, my work with the airline remained steady, allowing me the time and motivation to pursue a side project for extra income. Although I was working part-time as a waiter in an upscale restaurant, where about six flight attendants also worked during their off days, I wanted to create something more. Sheila began to get into her knitting on a Passap 12, a very basic machine that could perform a limited number of well-known stitches by pushing cams left and right on the knitting bed. Despite its limitations, Sheila did remarkably well with what she had. Through an ad in the local newspaper looking for knitters, she received a few orders for baby knitwear, including little booties, mittens, and bonnets. One day, after completing a small order, I took her to meet her agent. He presented Sheila with a garment and asked if she could reproduce it on her machine. This was where it all truly began&mdash;Magner Knitwear. The item was what they called \"crawlers,\" an all-in-one pair of knitted pants for babies. We took the garment home, examined its construction, and came up with a design for our machine. After many attempts, we finally produced a garment that resembled the crawler. We brought it back to the agent to see if it met his standards and to discuss pricing, quantities, and timelines since production was quite time-consuming. Additionally, sourcing knitting yarn in New Zealand was challenging; most raw materials were imported and required an import license. As we discussed these challenges, the agent mentioned he had a business and could provide us with the yarn. He gave us a price he would pay, so we returned home determined to find a faster, more efficient way to produce these garments.<br>We reached out to Passap knitting machines, based in Switzerland, and they recommended upgrading to the Duomatic, a more advanced machine that could be placed on a stand with an electric motor to drive it left and right. It came with plenty of great accessories to enhance our knitting production. It was a no-brainer; we felt it would be a worthwhile investment. We could sell the Passap 12, recoup some of our costs from the UK, and perhaps even make a little profit from selling it in New Zealand due to the import licensing. That&rsquo;s how it all started. When the new machine arrived, we both dove into learning how to use the Passap Duomatic. Over time, we acquired all the latest accessories to make our work on the machine quicker and more efficient. The finished garment was now an all-in-one piece with a shaped toe and heel for little feet, requiring only two places for extra sewing to complete the crawler, which could be done in just a few minutes.<br>It wasn't long before we realized that we had the beginnings of a small business. Our little baby, Carolyn, became the model for our creations as we perfected the crawlers. We purchased another machine so that when I wasn't flying, we could both produce garments. The range was expanding significantly, and it was only a matter of designing a little coat to create pram sets, along with other items like bootees, mittens, bonnets, and matinee jackets. We decided to venture out on our own to sell our baby wear. We bought a shelf company named Mickycliff Pty Ltd and introduced Magner Knitwear to a company that sold to clothing stores. These companies would travel the country to obtain future orders, a process we learned is called indenting. We applied for an import license to bring in our own yarn. After receiving our first indented order, it became clear that we had taken on more than we could handle. We faced a decision: either reduce our range or bite the bullet by purchasing more machines, training people to operate them, and hiring outworkers to sew the garments. At the same time, I wasn't ready to give up my job at Air NZ, as it was too early in the creation of Magner Knitwear. Besides, we needed the income to live on, as raw materials had to be bought and outworkers needed to be paid..<br>We carried on this way for the coming year. Henry proposed to Francis and, happily, she accepted.&nbsp;<a title=\"Henry and Francis\" href=\"../../../media/images/HenryFrancis.jpg\" target=\"_blank\" rel=\"noopener\">They married,</a> and it was a lovely thing to witness. After their wedding, Henry moved out, and they found a nice little unit to live together happily. This change opened the door for us to move on as well, especially since the children were growing so quickly and the knitting supplies were taking up too much space in our home. We decided to place the house on Gordon Ave on the market. Eventually, we found a bigger home not far away at Chambells Bay&mdash;274 Beach Rd, to be precise. It had five bedrooms, a lovely old English garden, and a huge deck perfect for outdoor dining. Set back from the main road, it was quiet despite being on a busy thoroughfare leading to the beach on the North Shore. We settled well into Beach Rd, and the children were very happy with a beach just across the road. Their joy flowed through to Sheila, making her content as well. At Air NZ, I was promoted to senior steward, where I looked after all the economy passengers on a DC-8 and all passengers on the Lockheed Electra, along with the crew I flew with.<br>I have wonderful memories of Beach Rd, where we bought our first caravan. New Zealand was the perfect country for camping, caravan trips, and bushwalking. There were so many breathtaking places to explore, with rivers flowing with beautiful, ice-cold water from the mountains. These locations made ideal spots for overnight stops, allowing us to visit surrounding areas of interest. During the summers, we would load up the caravan and travel to various sites, enjoying long weekends filled with adventure. Each trip was an opportunity to reconnect with nature, create lasting memories, and bond as a family.<br>Other Great Memories from Beach Rd The amazing kitchen at Beach Rd had plenty of room, and we upgraded it at the time when wall ovens were all the rage. With multi-use cooktops, I was excited to bring back the latest trends and gadgets from my trips to the USA, which I installed in our kitchen. With my background in hospitality, it was an easy transition to continue the tradition of afternoon teas at Beach Rd. We often baked a great variety of well-known sponges, cream cakes, and more. Everything was beautifully arranged on a lovely brass trolley, accompanied by assorted sandwiches, all cut into little triangles. We would invite Henry and Francis to join us, along with other friends. Thinking back, every meal we shared at Beach Rd felt like a gourmet experience. My time working in the airline industry, where I prepared meals for first-class passengers, also contributed to this. I would have been in the first-class galley, preparing food using only the finest ingredients, all meticulously installed by the ground catering department. I suppose as well it all goes back to Clare House, where Mum and Dad always provided us with the best food, preparing everything with care and attention to detail.</p>\r\n</div>", "cover_image": "images/passap.jpg", "slug": "chapter-15", "created_at": "2025-06-29T10:49:14.489Z", "updated_at": "2025-07-03T07:19:05.058Z", "order": 16}}, {"model": "chapters.chapter", "pk": 46, "fields": {"title": "Chapter 16", "subtitle": "<p>We faced yet another life-changing decision: we could either remain a small cottage industry or take the leap to expand into a larger manufacturing operation. We went from working out of our home base to relocating and getting the machinery and stock out of the home</p>", "content": "<div class=\"content\">\r\n<p>We moved the business out of our home as we learned to operate the commercial knitting machines. Along the way, we purchased two more machines. This led to three relocations, with the final one being a fully equipped factory featuring a mezzanine floor and ample space for additional production equipment. The last move was particularly beneficial&mdash;we ended up next to a bicycle shop that wanted to expand. They offered to find us a replacement location and cover the costs of setting up and moving all our machines. It was an offer we couldn&rsquo;t refuse. We settled well into our new premises and employed a small team of talented individuals, each with their area of expertise. We worked together until the early 1980s, and during that time, they all became close friends. Sheila returned to managing the home and caring for the children but continued to contribute to the business in her way.</p>\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; During this period, we upgraded our caravan to a six-berth Crusader. We purchased a &nbsp;<a href=\"../../../static/images/Caravan 1977 Edited.jpg\" target=\"_blank\" rel=\"noopener\">Chrysler Valiant</a> as a towing vehicle&mdash;a car I absolutely loved and still consider the best I&rsquo;ve ever owned. With this setup, we embarked on some amazing trips, including a memorable journey to South Island, traveling all the way down to Christchurch.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; We also moved into a bigger home, a newly built six-bedroom house with a rumpus room and all the modern amenities. After some time, we installed a swimming pool, which added so much enjoyment to our lives. I even had the chance to bring my mother out for another visit, which was truly special.&lt;br/&gt;Life was good, though a little hectic at times with Magner Knitwear, while I continued flying with Air New Zealand. The airline was also expanding, with more aircraft allowing for increased frequencies and new destinations. This meant my downtime between flights was kept to a bare minimum.</p>\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Eventually, Jumbo jets arrived, and our trips away grew longer, sometimes lasting up to 19 days. Upon returning from a trip, we would typically receive a new roster. Most of the time, we were given the standard three days off, only to be back on standby on the fourth day, ready for several possible flights or assigned to a specific one. After completing my training for the Jumbos, I was added to their flight roster. In time, I found myself assigned to the extensive 19-day trips with the following route: Auckland &ndash; Honolulu &ndash; Los Angeles &ndash; Tahiti &ndash; Los Angeles &ndash; Honolulu &ndash; Auckland. While it might sound exotic, the reality was far less glamorous. We had only the bare minimum time off between flights, and crossing six different time zones on the return trip made maintaining a proper sleep pattern nearly impossible.&nbsp;</p>\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The flights were usually full and incredibly busy, with the economy section alone accommodating 380&ndash;400 passengers. On one particular trip, I returned home utterly exhausted. To my surprise, when I checked my next roster, I saw that I was on standby for the same 19-day flight just three days later.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Normally, being called out on standby was infrequent, as crew members understood how such assignments could impact one another. But this time, I was called back for the same demanding itinerary. The strain was immense&mdash;not just for me but also for Sheila and the family. By the time I returned home from the second trip, I was knackered.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; In the end, I had to see the company doctor, who agreed that the schedule had been far too taxing for my body. As a result, I was granted three weeks of leave to recover.</p>\r\n<p>I&rsquo;m sharing this because it led to my decision to resign from Air New Zealand. After taking another three weeks off, I still didn&rsquo;t feel quite right. I was offered additional time off, but I felt it was the right moment to step away&mdash;for my family&rsquo;s sake. The children were growing older, and I wanted to spend more time with them before they became too independent. I also wanted to give Sheila more support and dedicate myself more fully to Magner Knitwear.</p>\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; With a heavy heart, I wrote my resignation letter. I had spent nearly eight years with Air New Zealand, and while it was difficult to leave, I knew it was the right decision. Shortly after, I received a thoughtful letter from the company expressing regret at my departure and thanking me for my service. It was a kind and personal gesture, and I truly appreciated it.&lt;br/&gt;Just after I resigned from Air New Zealand, we received the terrible news of an aircraft crash in Antarctica. After the delivery of the DC10 jumbo jet, Air New Zealand started sightseeing flights over the Antarctic. The Mount Erebus disaster occurred on 28 November 1979, when Air New Zealand Flight 901 flew into Mount Erebus on Ross Island, Antarctica, killing all 237 passengers and 20 crew members on board. Air New Zealand has been operating scheduled Antarctic sightseeing flights since 1977.</p>\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; I was devastated by the news. I knew all the crew and had flown with them, especially the cabin crew. While I was never rostered for these flights, it could very well have been my turn. It took a long time to get over this tragedy.&lt;a href=\"https://en.wikipedia.org/wiki/Mount_Erebus_disaster\"&gt;If you would like to read more about the disaster&lt;/a&gt;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &lt;br&gt;Around that time, New Zealand underwent a significant shift by removing most import licensing and opening the country to products from around the world. This change flooded the market with cheap imports, which posed challenges for local businesses like ours.</p>\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Unfortunately, the removal of import licensing didn&rsquo;t benefit us much. While we could now import as much knitting yarn as needed, the prices remained unchanged. Within a month of this policy change, our wholesaler showed us samples of imported babywear he could source, along with the prices he&rsquo;d pay for them.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Having just left Air New Zealand, this wasn&rsquo;t the future we had envisioned. The imported products were incredibly cheap, and competing with those prices seemed almost impossible. We quickly realized we needed to rethink our approach if we wanted to continue operating. The move into the bigger home was great for the children, as each got their bedroom, and we had a rumpus room. We also installed a swimming pool, and we had great times all around.</p>\r\n<p>However, having left Air New Zealand and with Magner Knitwear undergoing significant changes to remain competitive, I was unknowingly affected. I began to stress out and experienced periods of depression and anxiety, which I referred to as the \"black dog.\" I tried to keep it to myself, but it probably showed when my alcohol intake increased. Unfortunately, Sheila bore the brunt of it all.&lt;br/&gt;</p>\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; This difficult period lasted for about 12 to 18 months. Eventually, the business stabilized, and we were making a living from it, but the enjoyment and creativity were gone. I decided it was time to change my lifestyle. I started jogging, joined a gym, and attended philosophy lessons twice a week for four years. I learned a lot from these lessons and have continued going to the gym for over 40 years.&lt;br/&gt;I also started to look for a new business opportunity. I had always been interested in real estate, so I decided to get my real estate license. I worked for a company called Barfoot &amp; Thompson, which was a great experience. I enjoyed the work and the people I met, but I found it challenging to make a living from it. I was used to a regular income, and real estate was very unpredictable. I decided to leave the industry and look for something else.</p>\r\n<p>Around this time, we were approached by a company that wanted to buy Magner Knitwear. They offered us a good price, and we accepted. We sold the business and moved on to new ventures. It was a bittersweet moment, as we had put so much time and effort into building Magner Knitwear. However, it was time to let Magner Knitwear go. We had taken it as far as we could, so we placed it on the market, and it sold after about a year.</p>\r\n</div>", "cover_image": "images/Magner_Knitwear.jpg", "slug": "chapter-16", "created_at": "2025-06-29T10:49:14.518Z", "updated_at": "2025-07-03T07:18:24.367Z", "order": 17}}, {"model": "chapters.chapter", "pk": 47, "fields": {"title": "Chapter 17", "subtitle": "<p>Finding Contentment Reflections on Time, Happiness, and Life&rsquo;s Journey.</p>", "content": "<div class=\"content\">\r\n<p>I never really thought about my age or how old I was&mdash;New Zealand had that kind of effect on you. Life here was so laid-back and easygoing that it almost felt timeless. Perhaps it was because we were truly happy, immersed in the simple joys of everyday life, that age never crossed our minds. We were too busy appreciating the beauty around us, the freedom to explore, and the sense of belonging we had created for ourselves.</p>\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; Looking back now, I realize that this contentment came from more than just the lifestyle; it stemmed from the life we had built&mdash;a life where we could truly be happy. We had worked hard to create stability and found joy in the moments that mattered most. It was a time of fulfillment, where the weight of life&rsquo;s worries seemed lighter, and for that, I am deeply grateful.<br>&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; I mention this reflection about age because of a particular experience I had at the gym. The gym was owned by Harry, a former naval instructor&mdash;a strict but kind man who was always great to talk to. On one visit, it was time for my three-month assessment, which Harry conducted with all his clients.<br>&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; During the assessment, Harry sat me down for a chat and, out of the blue, asked how old I was. To my surprise, I couldn&rsquo;t think of the answer right away. I hesitated and said, \"38, maybe 39?\" Harry quickly retorted, \"You&rsquo;re nearly 41!\" as he glanced at my profile card. Then, with a grin, he added, \"Don&rsquo;t you know when you were born?\" We had a good laugh about it, but the moment stuck with me.<br>&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; It dawned on me how many years had gone by without me even noticing. Life had been so full and satisfying that I hadn&rsquo;t stopped to reflect on the passage of time. It was a humorous yet poignant reminder of how deeply immersed I had been in the happiness and rhythm of daily life.<br>&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; Around this time, after selling the business, we were able to pay off the mortgage and settle other debts, leaving us debt-free. By then, I was in my early forties. Paul and Kathryn were considering university, Julia was exploring career options, Phillip had one year left at college, and Carolyn was enrolled at Carmel College.</p>\r\n<p>&nbsp; &nbsp; &nbsp; &nbsp; Sheila wasn&rsquo;t interested in traveling overseas, as we had already enjoyed numerous holidays across New Zealand during our time here. These trips were wonderful and created lasting memories for the whole family. By now, we had been in New Zealand for twelve years, and I had always told my family in the UK that I would return to visit them within ten years. It felt like the right time to make that trip.<br>&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; Thanks to my former employment with Air New Zealand, we were still eligible for reduced airline fares, so I went ahead and booked the journey. As Sheila preferred not to travel, Paul, who had recently obtained his driver&rsquo;s license, stepped up. He was more than capable of driving my car and taking Sheila and the family out whenever needed. He did an incredible job looking after everything in my absence, ensuring the family was well cared for.</p>\r\n</div>", "cover_image": "images/canterbury.jpg", "slug": "chapter-17", "created_at": "2025-06-29T10:49:14.539Z", "updated_at": "2025-07-03T07:17:25.258Z", "order": 18}}, {"model": "chapters.chapter", "pk": 48, "fields": {"title": "Chapter 18", "subtitle": "<p>An Unstoppable Journey: A Life of Ambition, Resilience, and Constant Reinvention Across Countries and Careers</p>", "content": "<div class=\"content\">\r\n<p>In the mid-seventies, as the children grew older, I developed an interest in taking them to different restaurants. This was partly for my benefit, as I still had a strong inclination toward hospitality. In the earlier days, as I believe I&rsquo;ve mentioned in a previous chapter, we used to host full-on afternoon teas for family and friends. Taking the children to restaurants was, in part, a way for me to stay connected to the industry and keep up with trends. However, at that time, New Zealand had a limited selection of places to enjoy a good meal out.</p>\r\n<p>&nbsp; That said, a few restaurants were starting to change the scene. One such place was a restaurant called Scoffers Inn, owned and operated by an English couple, Cliff and Zoe, who had fantastic ideas about how to run a restaurant with great menus and elegant d&eacute;cor. This was their second restaurant&mdash;the first, Nosh Inn, had equally creative charm, even in its name.<br>&nbsp;&nbsp;<br>&nbsp; After visiting Scoffers Inn several times, we became friendly with Cliff and Zoe. It was during one of these visits that they mentioned they were planning to sell the restaurant for personal reasons. Despite owning Magner Knitwear and having five children to care for, I seriously considered purchasing the restaurant. However, in their wisdom, they decided not to sell it to me. That&rsquo;s the kind of thoughtful people they were&mdash;they cared about my family and recognized the challenges we would face if we took on such a demanding business.<br>&nbsp; &nbsp;&nbsp;<br>&nbsp;Later, in the early eighties, while we were still operating Magner Knitwear, we reconnected with Cliff and Zoe after they opened another beautifully designed restaurant called The Sussex. Eventually, we agreed to run The Sussex on Thursdays, Fridays, and Saturdays for three months while they went overseas&mdash;a truly wonderful experience. Sheila took charge of making the desserts under Zoe&rsquo;s guidance, Julia and Phillip helped in the kitchen, and I managed the front of the house.</p>\r\n<p data-end=\"1391\" data-start=\"1156\">You might think, <em data-end=\"1389\" data-start=\"1173\">\"This guy has it made&mdash;he&rsquo;s been in New Zealand for just 15 years, owns a six-bedroom home with a swimming pool, and has raised five children. All he has to do is sit back, find some part-time work, and enjoy life.\"</em></p>\r\n<p data-end=\"1413\" data-start=\"1393\">Well, think again.</p>\r\n<p data-end=\"1445\" data-start=\"1415\">Life had other plans for me.</p>\r\n<p data-end=\"1654\" data-start=\"1447\">After Magner Knitwear, I found myself on a <strong data-end=\"1502\" data-start=\"1490\">new path</strong>, one that led through three more businesses and three more homes. Each step brought fresh challenges, unexpected turns, and&mdash;sometimes&mdash;outright chaos.</p>\r\n<p data-end=\"1654\" data-start=\"1447\">&nbsp;</p>\r\n<p data-end=\"1981\" data-start=\"1656\">First, I bought a <strong data-end=\"1697\" data-start=\"1674\">property in Redvale</strong>, north of Auckland, with a <strong data-end=\"1760\" data-start=\"1725\">glasshouse for growing tomatoes</strong>.</p>\r\n<h2 data-end=\"268\" data-start=\"221\"><strong data-end=\"266\" data-start=\"224\">Growing Glasshouse Tomatoes at Redvale</strong></h2>\r\n<p data-end=\"539\" data-start=\"270\">I never gave much thought to growing tomatoes&mdash;especially <strong data-end=\"350\" data-start=\"327\">glasshouse tomatoes</strong>&mdash;until I found myself doing exactly that. I had no real experience in it, apart from what I learned from <strong data-end=\"464\" data-start=\"455\">Henry</strong>, who had helped plant tomato plants in the garden back at Gordon Avenue.</p>\r\n<p data-end=\"848\" data-start=\"541\">The property had <strong data-end=\"585\" data-start=\"558\">two working glasshouses</strong>, with a third one still under construction. Our plan was to get the <strong data-end=\"678\" data-start=\"654\">two operational ones</strong> up and running for <strong data-end=\"724\" data-start=\"698\">full tomato production</strong>, which would take up all our time. We had no intention of hiring help&mdash;it was going to be just <strong data-end=\"845\" data-start=\"819\">us and the glasshouses</strong>.</p>\r\n<p data-end=\"1141\" data-start=\"850\">At the time, the <strong data-end=\"893\" data-start=\"867\">glasshouses were empty</strong>, as the previous owner had just completed his growing season. They needed to be <strong data-end=\"1003\" data-start=\"974\">cleaned out and fumigated</strong> before we could plant a new crop. Typically, you could <strong data-end=\"1087\" data-start=\"1059\">harvest two crops a year</strong>, with the <strong data-end=\"1113\" data-start=\"1098\">winter crop</strong> being the most rewarding.</p>\r\n<p data-end=\"1357\" data-start=\"1143\">Starting out, we had to be <strong data-end=\"1202\" data-start=\"1170\">careful with plant selection</strong>, as choosing the right variety was <strong data-end=\"1249\" data-start=\"1238\">crucial</strong>. We also had to ensure we had a <strong data-end=\"1307\" data-start=\"1282\">reliable water supply</strong> and <strong data-end=\"1332\" data-start=\"1312\">adequate heating</strong> for the winter months.</p>\r\n<p data-end=\"1587\" data-start=\"1359\">Looking back, when I first saw the property, I had been more focused on the <strong data-end=\"1457\" data-start=\"1435\">house and location</strong> rather than the actual <strong data-end=\"1519\" data-start=\"1481\">practicalities of growing tomatoes</strong>. In hindsight, I probably should have asked a lot more questions.</p>\r\n<h3 data-end=\"1632\" data-start=\"1589\"><strong data-end=\"1630\" data-start=\"1593\">A Lesson in Plumbing&mdash;The Hard Way</strong></h3>\r\n<p data-end=\"1740\" data-start=\"1634\">While I was learning about tomatoes, I also learned a thing or two about <strong data-end=\"1724\" data-start=\"1707\">water systems</strong>&mdash;the hard way.</p>\r\n<p data-end=\"1974\" data-start=\"1742\">At the time, we had <strong data-end=\"1786\" data-start=\"1762\">no town water supply</strong>&mdash;we relied completely on <strong data-end=\"1824\" data-start=\"1811\">rainwater</strong> collected from the roof and stored in a <strong data-end=\"1890\" data-start=\"1865\">huge round water tank</strong> beside the house. This single tank held all the <strong data-end=\"1971\" data-start=\"1939\">water we needed for the home</strong>.</p>\r\n<p data-end=\"2230\" data-start=\"1976\">One day, I noticed a <strong data-end=\"2011\" data-start=\"1997\">small leak</strong> at the very <strong data-end=\"2046\" data-start=\"2024\">bottom of the tank</strong>. Water was slowly dripping from a tap. Thinking I could fix it, I grabbed my <strong data-end=\"2149\" data-start=\"2124\">brand-new red toolbox</strong>&mdash;which, at that point, hadn&rsquo;t seen much use&mdash;and pulled out a shiny <strong data-end=\"2227\" data-start=\"2216\">spanner</strong>.</p>\r\n<p data-end=\"2281\" data-start=\"2232\">Now, you can probably guess what happened next.</p>\r\n<p data-end=\"2474\" data-start=\"2283\">I gave the tap <strong data-end=\"2316\" data-start=\"2298\">one small turn</strong> with my spanner&mdash;and <em data-end=\"2344\" data-start=\"2337\">boom!</em> The <strong data-end=\"2371\" data-start=\"2349\">tap blew right off</strong>! A <strong data-end=\"2399\" data-start=\"2375\">huge deluge of water</strong> came rushing out, completely emptying the tank within <strong data-end=\"2471\" data-start=\"2454\">15&ndash;20 minutes</strong>.</p>\r\n<p data-end=\"2530\" data-start=\"2476\">All I could do was shout, <em data-end=\"2528\" data-start=\"2502\">&ldquo;Someone get a plumber!&rdquo;</em></p>\r\n<p data-end=\"2751\" data-start=\"2532\">Needless to say, I <strong data-end=\"2590\" data-start=\"2551\">wasn&rsquo;t the family&rsquo;s favorite person</strong> that day. We had to wait several days for a <strong data-end=\"2653\" data-start=\"2635\">water delivery</strong>, and in the meantime, everyone had to be extremely careful with whatever little water was left.</p>\r\n<h3 data-end=\"2778\" data-start=\"2753\"><strong data-end=\"2776\" data-start=\"2757\">Life at Redvale</strong></h3>\r\n<p data-end=\"2974\" data-start=\"2780\">At the time, <strong data-end=\"2832\" data-start=\"2793\">Paul and Kathryn were at university</strong>, Julia was working at a <strong data-end=\"2865\" data-start=\"2857\">bank</strong>, Phillip was finishing his <strong data-end=\"2917\" data-start=\"2893\">last year at Rosmini</strong>, and Carolyn was about to start at <strong data-end=\"2971\" data-start=\"2953\">Carmel College</strong>.</p>\r\n<p data-end=\"3263\" data-start=\"2976\">Despite my plumbing disaster, we <strong data-end=\"3044\" data-start=\"3009\">did get the glasshouses planted</strong> and managed to grow <strong data-end=\"3087\" data-start=\"3065\">six or seven crops</strong> while we lived there. The <strong data-end=\"3128\" data-start=\"3114\">final crop</strong> was the best one we had&mdash;it was even considered <strong data-end=\"3203\" data-start=\"3176\">the top-quality produce</strong> at the <strong data-end=\"3260\" data-start=\"3211\">Auckland fruit and vegetable market that year</strong>.</p>\r\n<p data-end=\"3582\" data-start=\"3265\">During our time at Redvale, we also <strong data-end=\"3323\" data-start=\"3301\">extended the house</strong> and built a <strong data-end=\"3361\" data-start=\"3336\">new farmhouse kitchen</strong>&mdash;a <strong data-end=\"3390\" data-start=\"3364\">large, welcoming space</strong> where the whole family could gather for meals. The <strong data-end=\"3467\" data-start=\"3442\">benches and cupboards</strong> were made of <strong data-end=\"3497\" data-start=\"3481\">Fijian Kauri</strong>, and it truly became <strong data-end=\"3579\" data-start=\"3519\">a wonderful place to cook, eat, and share family moments</strong>.</p>\r\n<h3 data-end=\"3623\" data-start=\"3584\"><strong data-end=\"3621\" data-start=\"3588\">Moving On, But Not Forgetting</strong></h3>\r\n<p data-end=\"3855\" data-start=\"3625\">After the <strong data-end=\"3658\" data-start=\"3635\">water tank disaster</strong>, it was suggested that&mdash;before I could do any more damage&mdash;I should look for a <strong data-end=\"3753\" data-start=\"3736\">part-time job</strong>. So, I got a job as a <strong data-end=\"3805\" data-start=\"3776\">knitting machine operator</strong> at a <strong data-end=\"3852\" data-start=\"3811\">knitwear clothing company in Auckland</strong>.</p>\r\n<p data-end=\"4109\" data-start=\"3857\">Looking back, <strong data-end=\"3882\" data-start=\"3871\">Redvale</strong> wasn&rsquo;t just about <strong data-end=\"3921\" data-start=\"3901\">growing tomatoes</strong>&mdash;it was about the <strong data-end=\"3987\" data-start=\"3939\">memories, lessons, and family time we shared</strong>. There were so many <strong data-end=\"4034\" data-start=\"4008\">events and experiences</strong> there that I could probably write an entire <strong data-end=\"4106\" data-start=\"4079\">book just about Redvale</strong>.</p>\r\n<p data-end=\"1981\" data-start=\"1656\">For three years, we worked the land, nurturing crop after crop while adjusting to country life. It was hard work, but it had its moments. (I could write a whole chapter on the <strong data-end=\"1964\" data-start=\"1938\">mishaps and adventures</strong> we had there.)</p>\r\n<p data-end=\"1981\" data-start=\"1656\">And may I will.</p>\r\n<p data-end=\"2240\" data-start=\"1983\">Then came <strong data-end=\"2008\" data-start=\"1993\">The Kitchen</strong>, a new business, followed by a home on Manuka Road in Glenfield.</p>\r\n<hr data-end=\"117\" data-start=\"114\">\r\n<h2 data-end=\"164\" data-start=\"119\"><strong data-end=\"162\" data-start=\"122\">From Redvale to the Kitchen Business</strong></h2>\r\n<p data-end=\"440\" data-start=\"166\">Selling <strong data-end=\"185\" data-start=\"174\">Redvale</strong> turned out to be quite an experience. The property had been on the market for some time, but in the end, there were <strong data-end=\"324\" data-start=\"302\">two serious buyers</strong>. The real estate agent knew <strong data-end=\"381\" data-start=\"353\">exactly how to work them</strong>, playing them against each other in a <strong data-end=\"437\" data-start=\"420\">Dutch auction</strong>.</p>\r\n<p data-end=\"651\" data-start=\"442\">Fortunately, we ended up getting a <strong data-end=\"508\" data-start=\"477\">good price for the property</strong>&mdash;even though we <strong data-end=\"563\" data-start=\"524\">never finished the third glasshouse</strong>. Looking back, I believe it was <strong data-end=\"622\" data-start=\"596\">the kitchen renovation</strong> that helped seal the deal.</p>\r\n<h3 data-end=\"686\" data-start=\"653\"><strong data-end=\"684\" data-start=\"657\">A New Home in Glenfield</strong></h3>\r\n<p data-end=\"1026\" data-start=\"688\">After selling Redvale, we found a <strong data-end=\"747\" data-start=\"722\">new home in Glenfield</strong>, still on <strong data-end=\"784\" data-start=\"758\">Auckland&rsquo;s North Shore</strong>. It was a <strong data-end=\"818\" data-start=\"795\">three-bedroom house</strong> with a <strong data-end=\"864\" data-start=\"826\">great dining room, a lovely lounge</strong>, and something truly special&mdash;<strong data-end=\"921\" data-start=\"894\">two giant Redwood trees</strong>. They reminded me of the ones in <strong data-end=\"969\" data-start=\"955\">California</strong>, and the house had a <strong data-end=\"1023\" data-start=\"991\">large deck built around them</strong>.</p>\r\n<p data-end=\"1352\" data-start=\"1028\">The <strong data-end=\"1047\" data-start=\"1032\">back garden</strong> was equally impressive, with a <strong data-end=\"1095\" data-start=\"1079\">small stream</strong> running through it. Growing along the edges was <strong data-end=\"1164\" data-start=\"1144\">fresh watercress</strong>, perfect for <strong data-end=\"1203\" data-start=\"1178\">salads and sandwiches</strong>. The house itself sat on an <strong data-end=\"1255\" data-start=\"1232\">elevated brick base</strong>, which provided a <strong data-end=\"1302\" data-start=\"1274\">spacious downstairs area</strong>. It also came with a <strong data-end=\"1349\" data-start=\"1324\">large detached garage</strong>.</p>\r\n<p data-end=\"1457\" data-start=\"1354\">We settled in quickly, but&mdash;as always&mdash;it wasn&rsquo;t long before I started <strong data-end=\"1454\" data-start=\"1423\">looking for something to do</strong>.</p>\r\n<h3 data-end=\"1494\" data-start=\"1459\"><strong data-end=\"1492\" data-start=\"1463\">Starting Another Business</strong></h3>\r\n<p data-end=\"1830\" data-start=\"1496\">Looking back now, I realize I had plans for <strong data-end=\"1555\" data-start=\"1540\">Manuka Road</strong> that I never followed through on. The property had <strong data-end=\"1631\" data-start=\"1607\">half an acre of land</strong>, split by the <strong data-end=\"1656\" data-start=\"1646\">stream</strong>, which would have been <strong data-end=\"1710\" data-start=\"1680\">perfect for a large garden</strong>&mdash;flowers, vegetables, the works. But instead of focusing on that, I found myself <strong data-end=\"1827\" data-start=\"1791\">on the hunt for another business</strong>.</p>\r\n<p data-end=\"1880\" data-start=\"1832\">I&rsquo;ve never liked <strong data-end=\"1877\" data-start=\"1849\">working for someone else</strong>.</p>\r\n<p data-end=\"2148\" data-start=\"1882\">That&rsquo;s when I came across <strong data-end=\"1938\" data-start=\"1908\">a small commercial kitchen</strong> for sale. It was in an <strong data-end=\"1991\" data-start=\"1962\">old butcher&rsquo;s corner shop</strong>, complete with a <strong data-end=\"2060\" data-start=\"2009\">large bank of freezers, stainless steel benches</strong>, and a <strong data-end=\"2115\" data-start=\"2068\">designated area for an oven and dishwashing</strong>. It was the <strong data-end=\"2145\" data-start=\"2128\">perfect setup</strong>.</p>\r\n<p data-end=\"2447\" data-start=\"2150\">We started producing <strong data-end=\"2225\" data-start=\"2171\">desserts, quiches, cheesecakes, cakes, and muffins</strong>, supplying them to <strong data-end=\"2309\" data-start=\"2245\">delis, pubs, hospitals, and restaurants across Auckland City</strong>. I <strong data-end=\"2337\" data-start=\"2313\">loved the creativity</strong> of it all&mdash;experimenting with recipes, making delicious products, and seeing them enjoyed by so many people.</p>\r\n<h3 data-end=\"2485\" data-start=\"2449\"><strong data-end=\"2483\" data-start=\"2453\">Another One Bites the Dust</strong></h3>\r\n<p data-end=\"2572\" data-start=\"2487\">I can&rsquo;t recall exactly how long we ran the business, but I do remember enjoying it.</p>\r\n<p data-end=\"2723\" data-start=\"2574\">Then, one day, someone <strong data-end=\"2625\" data-start=\"2597\">walked in off the street</strong>, saw what we were doing, and <strong data-end=\"2667\" data-start=\"2655\">loved it</strong>. They made an <strong data-end=\"2703\" data-start=\"2682\">offer on the spot</strong>, and we accepted.</p>\r\n<p data-end=\"2773\" data-start=\"2725\">Just like that&mdash;<strong data-end=\"2771\" data-start=\"2740\">another one bites the dust.</strong></p>\r\n<p data-end=\"2240\" data-start=\"1983\">From there, I jumped into the <strong data-end=\"2127\" data-start=\"2104\">restaurant industry</strong> with the purchase of a <strong data-end=\"2171\" data-start=\"2151\">pizza restaurant, The El Greco</strong> , moving our home once again&mdash;this time to Onewa Road in Birkenhead.</p>\r\n<hr data-end=\"97\" data-start=\"94\">\r\n<h2 data-end=\"137\" data-start=\"99\"><strong data-end=\"135\" data-start=\"102\">El Greco &ndash; A Slice of Success</strong></h2>\r\n<p data-end=\"312\" data-start=\"139\">El Greco was a <strong data-end=\"179\" data-start=\"154\">great little business</strong>. Our main trade was <strong data-end=\"230\" data-start=\"200\">takeaway pastas and pizzas</strong>, with a small <strong data-end=\"260\" data-start=\"245\">dining room</strong> that could accommodate <strong data-end=\"309\" data-start=\"284\">a dozen or so patrons</strong>.</p>\r\n<p data-end=\"599\" data-start=\"314\">We bought the pizza shop from <strong data-end=\"362\" data-start=\"344\">two Greek guys</strong>, who insisted&mdash;<strong data-end=\"399\" data-start=\"377\">quite emphatically</strong>&mdash;that the <strong data-end=\"453\" data-start=\"409\">Greeks, not the Italians, invented pizza</strong>. We didn&rsquo;t argue with them. Their <strong data-end=\"514\" data-start=\"488\">recipes and procedures</strong> were already well established, and to be fair, they <strong data-end=\"596\" data-start=\"567\">knew what they were doing</strong>.</p>\r\n<p data-end=\"745\" data-start=\"601\">At the time, <strong data-end=\"653\" data-start=\"614\">food delivery services didn&rsquo;t exist</strong>. If people wanted a pizza, they had to <strong data-end=\"742\" data-start=\"693\">call in their order and pick it up themselves</strong>.</p>\r\n<h3 data-end=\"777\" data-start=\"747\"><strong data-end=\"775\" data-start=\"751\">Running the Business</strong></h3>\r\n<p data-end=\"1002\" data-start=\"779\">Our workday started around <strong data-end=\"815\" data-start=\"806\">10 AM</strong>, prepping everything for the night ahead. Sheila and I would spend the <strong data-end=\"919\" data-start=\"887\">mornings in the back kitchen</strong>, while we had a young man named <strong data-end=\"959\" data-start=\"952\">Ken</strong> handling prep in the <strong data-end=\"999\" data-start=\"981\">front of house</strong>.</p>\r\n<p data-end=\"1183\" data-start=\"1004\">Ken was <strong data-end=\"1027\" data-start=\"1012\">a great lad</strong>&mdash;tall, handsome, with a <strong data-end=\"1078\" data-start=\"1051\">head full of curly hair</strong>. At just <strong data-end=\"1110\" data-start=\"1088\">nineteen or twenty</strong>, he was already a <strong data-end=\"1150\" data-start=\"1129\">true professional</strong> when it came to making pizzas.</p>\r\n<p data-end=\"1588\" data-start=\"1185\">The <strong data-end=\"1211\" data-start=\"1189\">pizza dough recipe</strong> was the heart of the business, and Ken had perfected the <strong data-end=\"1291\" data-start=\"1269\">art of handling it</strong>. He taught me a lot&mdash;how to <strong data-end=\"1357\" data-start=\"1319\">work the dough, shape it properly,</strong> and <strong data-end=\"1386\" data-start=\"1362\">get the best results</strong>. During service, he&rsquo;d <strong data-end=\"1445\" data-start=\"1409\">toss the dough high into the air</strong>, much to the delight of our customers. It became part of the <strong data-end=\"1530\" data-start=\"1507\">El Greco experience</strong>, turning a simple wait for food into <strong data-end=\"1585\" data-start=\"1568\">entertainment</strong>.</p>\r\n<p data-end=\"1738\" data-start=\"1590\">We were even <strong data-end=\"1624\" data-start=\"1603\">regularly visited</strong> by players from the <strong data-end=\"1671\" data-start=\"1645\">New Zealand All Blacks</strong>, who came in for a <strong data-end=\"1735\" data-start=\"1691\">good feed of carbohydrates before a game</strong>.</p>\r\n<p data-end=\"1800\" data-start=\"1740\">The menu was <strong data-end=\"1778\" data-start=\"1753\">simple but well-loved</strong>. <em data-end=\"1798\" data-start=\"1780\">(See menu link.)</em></p>\r\n<h3 data-end=\"1839\" data-start=\"1802\"><strong data-end=\"1837\" data-start=\"1806\">A New Home &amp; A New Question</strong></h3>\r\n<p data-end=\"2077\" data-start=\"1841\">As the business grew, we decided to <strong data-end=\"1904\" data-start=\"1877\">move closer to the shop</strong>. We found a <strong data-end=\"1951\" data-start=\"1917\">modern three-bedroom townhouse</strong>, with <strong data-end=\"1972\" data-start=\"1958\">city views</strong>, an <strong data-end=\"1998\" data-start=\"1977\">integrated garage</strong>, and a <strong data-end=\"2041\" data-start=\"2006\">master bedroom with an en suite</strong>&mdash;all spread over <strong data-end=\"2074\" data-start=\"2058\">three levels</strong>.</p>\r\n<p data-end=\"2095\" data-start=\"2079\">At this point:</p>\r\n<ul data-end=\"2302\" data-start=\"2096\">\r\n<li data-end=\"2143\" data-start=\"2096\"><strong data-end=\"2118\" data-start=\"2098\">Paul and Kathryn</strong> were at <strong data-end=\"2141\" data-start=\"2127\">university</strong></li>\r\n<li data-end=\"2191\" data-start=\"2144\"><strong data-end=\"2167\" data-start=\"2146\">Julia and Phillip</strong> had <strong data-end=\"2189\" data-start=\"2172\">gone overseas</strong></li>\r\n<li data-end=\"2249\" data-start=\"2192\"><strong data-end=\"2247\" data-start=\"2194\">Phillip had just completed his Engineering degree</strong></li>\r\n<li data-end=\"2302\" data-start=\"2250\">At home, it was just <strong data-end=\"2300\" data-start=\"2273\">Sheila, Carolyn, and me</strong></li>\r\n</ul>\r\n<p data-end=\"2382\" data-start=\"2304\"><strong data-end=\"2347\" data-start=\"2304\">Business was going well. Life was good.</strong> I thought we were all <strong data-end=\"2379\" data-start=\"2370\">happy</strong>.</p>\r\n<p data-end=\"2425\" data-start=\"2384\">Then, out of the blue, Sheila asked me:</p>\r\n<p data-end=\"2483\" data-start=\"2427\"><strong data-end=\"2481\" data-start=\"2427\">\"Have you ever thought about living in Australia?\"</strong></p>\r\n<p data-end=\"2611\" data-start=\"2485\">I was caught off guard. I had always talked about taking a <strong data-end=\"2564\" data-start=\"2544\">holiday overseas</strong>, but moving? That was a <strong data-end=\"2608\" data-start=\"2589\">different story</strong>.</p>\r\n<p data-end=\"2664\" data-start=\"2613\"><em data-end=\"2653\" data-start=\"2613\">\"Where in Australia are you thinking?\"</em> I asked.</p>\r\n<p data-end=\"2683\" data-start=\"2666\"><strong data-end=\"2681\" data-start=\"2666\">\"Brisbane.\"</strong></p>\r\n<p data-end=\"2715\" data-start=\"2685\">That surprised me even more.</p>\r\n<p data-end=\"2761\" data-start=\"2717\"><em data-end=\"2759\" data-start=\"2717\">\"Brisbane? But you&rsquo;ve never been there.\"</em></p>\r\n<p data-end=\"2921\" data-start=\"2763\">I knew Brisbane in the early 80s&mdash;it was&nbsp;<strong data-end=\"2839\" data-start=\"2804\">hot, humid, and far from modern</strong>. It wasn&rsquo;t like <strong data-end=\"2879\" data-start=\"2856\">Sydney or Melbourne</strong>. It was still <strong data-end=\"2918\" data-start=\"2894\">growing up as a city</strong>.</p>\r\n<p data-end=\"2993\" data-start=\"2923\">But now that the idea had been spoken aloud, it couldn&rsquo;t be ignored.</p>\r\n<p data-end=\"3049\" data-start=\"2995\">And to my surprise&mdash;<strong data-end=\"3047\" data-start=\"3014\">Carolyn was on Sheila&rsquo;s side.</strong></p>\r\n<p data-end=\"2351\" data-start=\"2242\">Looking back, I sometimes wonder: <em data-end=\"2349\" data-start=\"2276\">Was I searching for success? Or was I simply chasing something unknown?</em></p>\r\n<p data-end=\"2426\" data-start=\"2353\">And then, my journey took an even bigger leap&mdash;I moved to <strong data-end=\"2423\" data-start=\"2410\">Australia</strong>.</p>\r\n<p data-end=\"2527\" data-start=\"2428\">Australia became a fresh start, an entirely <strong data-end=\"2487\" data-start=\"2472\">new chapter</strong> filled with unexpected opportunities.</p>\r\n<p data-end=\"2794\" data-start=\"2529\"> <strong data-end=\"2600\" data-start=\"2532\">At the Britannia Inn during World Expo 1988, I worked as a chef.</strong><br data-end=\"2603\" data-start=\"2600\"> <strong data-end=\"2682\" data-start=\"2606\">I owned and operated a Silvio&rsquo;s Pizza franchise (now known as Domino&rsquo;s).</strong><br data-end=\"2685\" data-start=\"2682\"> <strong data-end=\"2733\" data-start=\"2688\">I opened my own restaurant, Robin&rsquo;s Nest.</strong><br data-end=\"2736\" data-start=\"2733\"> <strong data-end=\"2792\" data-start=\"2739\">I moved to Noosa and reunited with Cliff and Zoe.</strong></p>\r\n<p data-end=\"2980\" data-start=\"2796\">It was through Cliff that I had the chance to buy <strong data-end=\"2869\" data-start=\"2846\">Bali Hai Apartments</strong>, followed by the <strong data-end=\"2912\" data-start=\"2887\">Palm Grove Restaurant</strong>, which I renovated and turned into <strong data-end=\"2977\" data-start=\"2948\">Cheers Italian Restaurant</strong>.</p>\r\n<p data-end=\"3018\" data-start=\"2982\">But the journey didn&rsquo;t stop there.</p>\r\n<p data-end=\"3390\" data-start=\"3020\"> <strong data-end=\"3100\" data-start=\"3023\">I returned to Brisbane and partnered with Cliff to open Caf&eacute; Mediterrano.</strong><br data-end=\"3103\" data-start=\"3100\"> <strong data-end=\"3178\" data-start=\"3106\">I launched The Diet Place, later selling it to Continental Agencies.</strong><br data-end=\"3181\" data-start=\"3178\"> <strong data-end=\"3287\" data-start=\"3184\">At Continental, I became a Production Manager, overseeing fresh pizza manufacturing for Woolworths.</strong><br data-end=\"3290\" data-start=\"3287\"> <strong data-end=\"3388\" data-start=\"3293\">Then, when Continental acquired Rhonda Foods, I transitioned into managing p&acirc;t&eacute; production.</strong></p>\r\n<p data-end=\"3509\" data-start=\"3392\">For the life of me, I can&rsquo;t fully explain <strong data-end=\"3441\" data-start=\"3434\">why</strong> I&rsquo;ve never settled. Maybe it&rsquo;s ambition. Maybe it&rsquo;s restlessness.</p>\r\n<p data-end=\"3611\" data-start=\"3511\">But one thing is certain&mdash;each venture, each challenge, and each move shaped the person I am today.</p>\r\n<p data-end=\"3646\" data-start=\"3613\">And the story is far from over.</p>\r\n</div>", "cover_image": "images/tomatoes.jpg", "slug": "chapter-18", "created_at": "2025-06-29T10:49:14.587Z", "updated_at": "2025-07-03T07:16:33.565Z", "order": 19}}, {"model": "chapters.chapter", "pk": 49, "fields": {"title": "Chapter 19", "subtitle": "<p>\"A New Beginning: My Journey to Australia\"</p>", "content": "<div class=\"content\">\r\n<p data-end=\"610\" data-start=\"257\">We arrived in Brisbane for the World Expo in the second week of April 1988. The Expo had just opened that month and was set to run until October. It was a great opportunity to find employment. With my roots in the UK, I applied to work at the English stand and was instantly hired as a Chef at the Britannia Inn&mdash;a replica of a traditional English pub.</p>\r\n<p data-end=\"1010\" data-start=\"612\">The shifts were long and incredibly busy, but it was a lot of fun. The atmosphere was completely different from anything I had experienced before. The Expo provided a <strong data-end=\"799\" data-start=\"779\">captive audience</strong>, and the crowds were there purely for enjoyment. Those of us working in the various country stands were there not just to serve but to <strong data-end=\"946\" data-start=\"935\">enhance</strong> visitors&rsquo; experiences by representing our respective nations.</p>\r\n<p data-end=\"1379\" data-start=\"1012\">I worked at the Britannia Inn until the end of the Expo. The restaurant was operated by <strong data-end=\"1128\" data-start=\"1100\">David Peters Restaurants</strong>, which had won the contract to run it. It was so successful that they purchased the replica pub, obtained the necessary permissions, and reopened it in Brisbane&rsquo;s Hyatt Arcade in November. They offered me a chef&rsquo;s position, which I gladly accepted.</p>\r\n<p data-end=\"1898\" data-start=\"1381\">At the Expo, the Britannia Pub had both an <strong data-end=\"1442\" data-start=\"1424\">Executive Chef</strong> and a <strong data-end=\"1462\" data-start=\"1449\">Head Chef</strong>. Each week, they would arrive dressed immaculately in freshly laundered uniforms, with their chef hats getting progressively taller. This went on for several months, each trying to <strong data-end=\"1653\" data-start=\"1644\">outdo</strong> the other. Word spread across the Expo site, and it became a source of amusement for other restaurant teams, with their own chefs joining in the hat competition. It was hilarious to watch these self-important chefs parade around, showing off.</p>\r\n<p data-end=\"2266\" data-start=\"1900\">Ironically, neither the Executive Chef nor the Head Chef actually worked in the kitchen with me and the rest of the team. By the end of the first week at the newly opened <strong data-end=\"2096\" data-start=\"2071\">Britannia in Brisbane</strong>, both were gone&mdash;the Executive Chef was <strong data-end=\"2146\" data-start=\"2136\">sacked</strong>, and the Head Chef managed to <strong data-end=\"2199\" data-start=\"2177\">chop off his thumb</strong> while demonstrating to apprentice chefs how to cut up a chicken!</p>\r\n<p data-end=\"2554\" data-start=\"2268\">Shortly after, I was offered the <strong data-end=\"2314\" data-start=\"2301\">Head Chef</strong> position, which I accepted. The owners brought in a new <strong data-end=\"2389\" data-start=\"2371\">Executive Chef</strong>, a Spanish gentleman. It was a strange setup&mdash;despite being Head Chef, I was never consulted on how the restaurant should operate or what direction it should take.</p>\r\n<p data-end=\"2929\" data-start=\"2556\">At one point, the restaurant introduced a <strong data-end=\"2613\" data-start=\"2598\">new kitchen</strong> at the back, facing <strong data-end=\"2659\" data-start=\"2634\">Elizabeth Street Mall</strong>. It had an <strong data-end=\"2690\" data-start=\"2671\">Oriental design</strong> and served cuisine to match. They hired a <strong data-end=\"2746\" data-start=\"2733\">Thai chef</strong> to run that section, meaning I had no involvement in it. My expertise at the time was in <strong data-end=\"2868\" data-start=\"2836\">Italian, French, and English</strong> cuisine, so I didn&rsquo;t know much about <strong data-end=\"2926\" data-start=\"2906\">Oriental cooking</strong>.</p>\r\n<p data-end=\"3284\" data-start=\"2931\">Months passed, and the Britannia was doing <strong data-end=\"2989\" data-start=\"2974\">big numbers</strong>. Everything seemed to be going well, but the Executive Chef became increasingly agitated. Eventually, he pulled me aside and asked me to <strong data-end=\"3155\" data-start=\"3127\">defend him to the owners</strong>. I had no idea what was going on. I&rsquo;ve never liked getting involved in <strong data-end=\"3258\" data-start=\"3227\">workplace politics or drama</strong>, so I stayed out of it.</p>\r\n<p data-end=\"3415\" data-start=\"3286\">Just before I was offered the Head Chef position, I had been looking into a <strong data-end=\"3387\" data-start=\"3362\">franchise opportunity</strong> with <strong data-end=\"3412\" data-start=\"3393\">Silvio&rsquo;s Pizzas</strong>&hellip;</p>\r\n<h3 data-end=\"361\" data-start=\"313\"><strong data-end=\"359\" data-start=\"317\">Silvio&rsquo;s Pizza: A Franchise Experience</strong></h3>\r\n<p data-end=\"601\" data-start=\"363\">Just before I was offered the Head Chef&rsquo;s position, I had been exploring a business opportunity with <strong data-end=\"482\" data-start=\"464\">Silvio&rsquo;s Pizza</strong>, a franchise run by an Italian family. The company operated <strong data-end=\"568\" data-start=\"543\">pizza delivery stores</strong> throughout Brisbane&rsquo;s suburbs.</p>\r\n<p data-end=\"844\" data-start=\"603\">Like any business, I knew it was important to <strong data-end=\"672\" data-start=\"649\">do my due diligence</strong>, so I took the franchise's financial records to an accountant. He was supposed to <strong data-end=\"794\" data-start=\"755\">investigate the business thoroughly</strong>, and his conclusion? <em data-end=\"842\" data-start=\"816\">\"Everything seems fine.\"</em></p>\r\n<p data-end=\"980\" data-start=\"846\">With that assurance, I <strong data-end=\"886\" data-start=\"869\">struck a deal</strong> with the main figure running the business&mdash;one of the family members, whose name was Silvio.</p>\r\n<h3 data-end=\"1023\" data-start=\"982\"><strong data-end=\"1021\" data-start=\"986\">Running the Stones Corner Store</strong></h3>\r\n<p data-end=\"1413\" data-start=\"1025\">The store I acquired was located in <strong data-end=\"1078\" data-start=\"1061\">Stones Corner</strong>, a <strong data-end=\"1129\" data-start=\"1082\">busy suburb close to Brisbane&rsquo;s city center</strong>. It had been managed by one of Silvio&rsquo;s appointed managers before I took over. To maintain consistency, I <strong data-end=\"1257\" data-start=\"1236\">kept him on staff</strong>, along with several young men&mdash;mostly students&mdash;who worked as delivery drivers. We didn&rsquo;t want to interfere with the <strong data-end=\"1395\" data-start=\"1373\">flow of production</strong> and operations.</p>\r\n<p data-end=\"1648\" data-start=\"1415\">At first, the store seemed like a <strong data-end=\"1469\" data-start=\"1449\">great investment</strong>. It was <strong data-end=\"1510\" data-start=\"1478\">busy every night of the week</strong>, especially during the dinner period. But after <strong data-end=\"1581\" data-start=\"1559\">five or six months</strong>, I began to notice that <strong data-end=\"1645\" data-start=\"1606\">things weren&rsquo;t quite as they seemed</strong>.</p>\r\n<p data-end=\"1882\" data-start=\"1650\">At the same time, another <strong data-end=\"1707\" data-start=\"1676\">franchise store in Capalaba</strong> had been sold to another franchisee. Every <strong data-end=\"1764\" data-start=\"1751\">two weeks</strong>, we attended <strong data-end=\"1800\" data-start=\"1778\">franchise meetings</strong> at Silvio&rsquo;s head office to discuss marketing strategies and promotional offers.</p>\r\n<p data-end=\"1931\" data-start=\"1884\">And that&rsquo;s when we made a shocking discovery.</p>\r\n<h3 data-end=\"1983\" data-start=\"1933\"><strong data-end=\"1981\" data-start=\"1937\">The Truth About Silvio&rsquo;s Franchise Model</strong></h3>\r\n<p data-end=\"2071\" data-start=\"1985\">It turned out that <strong data-end=\"2068\" data-start=\"2004\">me and the Capalaba owner were the only two real franchisees</strong>.</p>\r\n<p data-end=\"2296\" data-start=\"2073\">Every other Silvio&rsquo;s store was being managed by <strong data-end=\"2140\" data-start=\"2121\">young employees</strong> who had no experience running a business. They were only trained to do one thing:<br data-end=\"2225\" data-start=\"2222\"> <strong data-end=\"2294\" data-start=\"2228\">Make pizzas as fast as possible and get them out for delivery.</strong></p>\r\n<p data-end=\"2428\" data-start=\"2298\">But there were <strong data-end=\"2328\" data-start=\"2313\">major flaws</strong> in the business model that neither my accountant nor I had picked up on. The biggest issues were:</p>\r\n<p data-end=\"2464\" data-start=\"2430\">1 <strong data-end=\"2462\" data-start=\"2434\">The \"Two-for-One\" Offer:</strong></p>\r\n<ul data-end=\"2730\" data-start=\"2468\">\r\n<li data-end=\"2570\" data-start=\"2468\">This deal was run <strong data-end=\"2502\" data-start=\"2488\">frequently</strong>, yet franchisees still had to pay <strong data-end=\"2567\" data-start=\"2537\">full price for ingredients</strong>.</li>\r\n<li data-end=\"2730\" data-start=\"2574\">When we asked how we were supposed to make a profit while giving away half our pizzas, their answer was: <em data-end=\"2728\" data-start=\"2681\">\"You&rsquo;ll sell more pizzas and make more cash.\"</em></li>\r\n</ul>\r\n<p data-end=\"2777\" data-start=\"2732\">2 <strong data-end=\"2775\" data-start=\"2736\">The \"Free Pizza if Late\" Guarantee:</strong></p>\r\n<ul data-end=\"3168\" data-start=\"2781\">\r\n<li data-end=\"2851\" data-start=\"2781\">If deliveries were <strong data-end=\"2813\" data-start=\"2802\">delayed</strong>, the customer got a <strong data-end=\"2848\" data-start=\"2834\">free pizza</strong>.</li>\r\n<li data-end=\"3049\" data-start=\"2855\">This happened <strong data-end=\"2887\" data-start=\"2871\">all the time</strong> during Queensland&rsquo;s <strong data-end=\"2924\" data-start=\"2908\">storm season</strong> (from late October to late February), when heavy rain would hit Brisbane <strong data-end=\"3022\" data-start=\"2998\">almost every evening</strong> between <strong data-end=\"3046\" data-start=\"3031\">4 PM &ndash; 8 PM</strong>.</li>\r\n<li data-end=\"3168\" data-start=\"3053\">Our delivery drivers struggled in these conditions, meaning <strong data-end=\"3165\" data-start=\"3115\">we were constantly giving away pizzas for free</strong>.</li>\r\n</ul>\r\n<p data-end=\"3385\" data-start=\"3170\">We fought back, demanding <strong data-end=\"3207\" data-start=\"3196\">changes</strong> to these policies. We suggested:<br data-end=\"3243\" data-start=\"3240\"> Either <strong data-end=\"3268\" data-start=\"3253\">discounting</strong> the cost of ingredients for two-for-one nights.<br data-end=\"3319\" data-start=\"3316\"> Suspending the <strong data-end=\"3358\" data-start=\"3337\">free pizza policy</strong> during the storm season.</p>\r\n<p data-end=\"3410\" data-start=\"3387\"><strong data-end=\"3408\" data-start=\"3387\">Silvio&rsquo;s refused.</strong></p>\r\n<h3 data-end=\"3448\" data-start=\"3412\"><strong data-end=\"3446\" data-start=\"3416\">Locked Out of My Own Store</strong></h3>\r\n<p data-end=\"3563\" data-start=\"3450\">Every franchise meeting turned into a battle between us and Silvio&rsquo;s management. Eventually, they&rsquo;d had enough.</p>\r\n<p data-end=\"3645\" data-start=\"3565\">One day, <strong data-end=\"3642\" data-start=\"3574\">both I and the Capalaba franchisee were locked out of our stores</strong>.</p>\r\n<p data-end=\"3714\" data-start=\"3647\">I didn&rsquo;t fight it. To be honest, I was <strong data-end=\"3711\" data-start=\"3686\">relieved to walk away</strong>.</p>\r\n<p data-end=\"3994\" data-start=\"3716\">My original deal had been that I&rsquo;d place a <strong data-end=\"3776\" data-start=\"3759\">small deposit</strong> and pay the rest after selling my business in New Zealand. Since I had kept postponing the payment, I hadn&rsquo;t lost too much money in the process. But I can&rsquo;t say what happened to the <strong data-end=\"3979\" data-start=\"3959\">other franchisee</strong> in Capalaba.</p>\r\n<p data-end=\"4132\" data-start=\"3996\">As for Silvio&rsquo;s? Their model was <strong data-end=\"4046\" data-start=\"4029\">unsustainable</strong>, and they soon realized they couldn&rsquo;t expand interstate under their own brand name.</p>\r\n<p data-end=\"4204\" data-start=\"4134\">That&rsquo;s when an opportunity arose&mdash;<strong data-end=\"4201\" data-start=\"4167\">Domino&rsquo;s Pizza was up for sale</strong>.</p>\r\n<p data-end=\"4314\" data-start=\"4206\">Silvio&rsquo;s acquired <strong data-end=\"4236\" data-start=\"4224\">Domino&rsquo;s</strong>, rebranded their stores, and began growing the business under the new name.</p>\r\n<p data-end=\"4487\" data-start=\"4316\">And here&rsquo;s the twist&mdash;one of those young <strong data-end=\"4374\" data-start=\"4356\">store managers</strong> from the Silvio&rsquo;s days eventually <strong data-end=\"4435\" data-start=\"4409\">bought out the company</strong>. Today, he is the <strong data-end=\"4484\" data-start=\"4454\">CEO of Domino&rsquo;s Queensland</strong>.</p>\r\n</div>", "cover_image": "images/expo88.jpg", "slug": "chapter-19", "created_at": "2025-06-29T10:49:14.623Z", "updated_at": "2025-07-03T07:15:50.517Z", "order": 20}}, {"model": "chapters.chapter", "pk": 50, "fields": {"title": "Chapter 20", "subtitle": "<p>The Start of the Gold Coast Marathon 1988</p>", "content": "<div class=\"content\">\r\n<h3 data-end=\"182\" data-start=\"144\"><strong data-end=\"180\" data-start=\"148\">Robin&rsquo;s Nest &ndash; A New Venture</strong></h3>\r\n<p data-end=\"513\" data-start=\"184\">After the Silvio&rsquo;s episode, I found a small restaurant for sale in Yeronga, a quiet suburb near the Brisbane River. The area had an interesting history&mdash;many of the streets and roads were named after P&amp;O shipping line vessels. In the late 1800s, P&amp;O&rsquo;s ships, both steam and sail, would travel up the river to this very location.</p>\r\n<p data-end=\"818\" data-start=\"515\">The business was originally a Danish cuisine restaurant, but it wasn&rsquo;t doing well and was being sold cheaply. I decided to turn it into a proper restaurant and named it <strong data-end=\"700\" data-start=\"684\">Robin&rsquo;s Nest</strong>. We were among the first establishments to obtain an outdoor table service license, which set us apart at the time.</p>\r\n<p data-end=\"1072\" data-start=\"820\">We hired a talented chef, and Carolyn and I managed the front of house. Once everything was set up and ready for service, Sheila came to see what we had done. However, she seemed slightly disappointed&mdash;she had expected me to open another <strong data-end=\"1069\" data-start=\"1057\">El Greco</strong>.</p>\r\n<p data-end=\"1747\" data-start=\"1074\">At this point, we were renting an apartment in Indooroopilly, which meant driving to the restaurant every day. This arrangement gave me the opportunity to get back into jogging and regain some fitness. Since moving to Australia, I had been going to the gym sporadically, but never consistently. I had done a little exercise during my time at Silvio&rsquo;s, where I encouraged the younger store and delivery staff to participate in a <strong data-end=\"1513\" data-start=\"1502\">fun run</strong>. They wore Silvio&rsquo;s shirts, effectively advertising their pizzas while we ran. It was a fantastic day&mdash;10 kilometers followed by a barbecue to celebrate. I even got a great massage afterward at Cleveland Point, right by the seaside.</p>\r\n<p data-end=\"1941\" data-start=\"1749\">After that, I let Carolyn drive the car home while I jogged back, which took about an hour. That&rsquo;s when my real training started. I set a goal for myself: <strong data-end=\"1938\" data-start=\"1904\">to run the Gold Coast Marathon</strong>.</p>\r\n<p data-end=\"2193\" data-start=\"1943\">The marathon itself was grueling, but finishing it gave me an immense sense of accomplishment. I was hooked. From then on, jogging became a regular part of my life. Brisbane was perfect for running, with plenty of safe and scenic routes to explore.</p>\r\n<h3 data-end=\"2214\" data-start=\"2195\"><strong data-end=\"2212\" data-start=\"2199\">Moving On</strong></h3>\r\n<p data-end=\"2410\" data-start=\"2216\">Back at <strong data-end=\"2240\" data-start=\"2224\">Robin&rsquo;s Nest</strong>, I gradually lost interest in running the place. When Easter approached, I made a sudden decision&mdash;I closed the restaurant for the holidays, posting a sign on the door:</p>\r\n<p data-end=\"2472\" data-start=\"2412\"><strong data-end=\"2470\" data-start=\"2412\">\"Closed for family reasons. Will reopen after Easter.\"</strong></p>\r\n<p data-end=\"2647\" data-start=\"2474\">Instead of reopening, we headed up to Noosa to visit <strong data-end=\"2544\" data-start=\"2527\">Cliff and Zoe</strong>. Before leaving, I placed a short <strong data-end=\"2604\" data-start=\"2579\">four- or five-line ad</strong> in the newspaper to sell the restaurant.</p>\r\n<p data-end=\"2871\" data-start=\"2649\">When we returned, to my surprise, there was already a couple waiting outside <strong data-end=\"2742\" data-start=\"2726\">Robin&rsquo;s Nest</strong>, eager to buy it. They had never owned a restaurant before but had experience running a <strong data-end=\"2848\" data-start=\"2831\">football club</strong>. Who was I to argue?</p>\r\n<p data-end=\"2956\" data-start=\"2873\">We agreed on a price, shook hands, and just like that&mdash;<strong data-end=\"2954\" data-start=\"2927\">another chapter closed.</strong></p>\r\n</div>", "cover_image": "images/marathon.jpg", "slug": "chapter-20", "created_at": "2025-06-29T10:49:14.645Z", "updated_at": "2025-07-03T07:15:11.470Z", "order": 21}}, {"model": "chapters.chapter", "pk": 52, "fields": {"title": "Chapter 21", "subtitle": "<p>Business Ventures and Personal Struggles:Navigating Life in Cafe Mediterraneo on Caxton Street in Brisbane</p>", "content": "<div class=\"content\">\r\n<p dir=\"ltr\">&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;Cliff wanted to find employment for his son and suggested we take a trip down to Brisbane to explore opportunities that could provide all of us with jobs and a worthwhile investment. The idea for the Caxton Street restaurant was that Cliff would buy the building, while I would purchase and run the restaurant. I would pay Cliff rent and employ his son, Gary.</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;At the time, I had a registered company, Mickeycliff Pty Ltd, which made an offer to buy the restaurant. The offer was accepted, but then Cliff changed his mind about purchasing the freehold. This left me in a difficult position, with Mickeycliff Pty Ltd committed to the purchase. I felt I had no choice but to move forward with the deal&mdash;I didn&rsquo;t want a court case hanging over me.</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Caxton Street is a very busy area, situated near Suncorp Stadium. It&rsquo;s a vibrant nightlife hub, and at the top of the street, the old Victoria Barracks was slated to be transformed into a residential and shopping precinct.</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Despite the excitement of this business venture, things between Sheila and me were not going well&mdash;we seemed to be drifting apart. While Sheila supported me in her own way, she was never interested in mixing or socializing with others, nor did she enjoy taking holidays with me. As long as she could get to church or use public transport to travel in or out of the city, she was content.</p>\r\n<p dir=\"ltr\">&nbsp;</p>\r\n<p dir=\"ltr\">Sheila didn&rsquo;t drive and had no desire to learn.</p>\r\n<p dir=\"ltr\">&nbsp;</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;When we returned to Brisbane to take over the running of the restaurants, we bought a lovely three-bedroom apartment in Paddington. It was conveniently close to Caxton Street, making it easier for me to manage Caf&eacute; Mediterraneo, and close to the city for Sheila.</p>\r\n<p dir=\"ltr\">Caf&eacute; Mediterraneo was a disaster. The Brisbane Broncos moved from Suncorp Stadium to the ANZ Stadium in Mt Gravatt, leaving a significant gap in foot traffic on Caxton Street. Patrons no longer frequented the area for food and drinks. Additionally, the planned residential apartments and shopping precinct at the old barracks were shelved due to heritage restrictions.</p>\r\n<p dir=\"ltr\">&nbsp;</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Caxton Street was full of restaurants, including Gambaro&rsquo;s, The LA Pub, Caxton Street Hotel, Casablanca Restaurant, Gambero&rsquo;s Seafood and Takeaway, and several nightclubs. The competition was intense, and trade was almost non-existent in the early days of the week. While Saturdays brought large bookings for hens&rsquo; nights, birthdays, and other celebrations&mdash;thanks to our courtyard&mdash;it still needed major repairs. During storms, the courtyard leaked everywhere, creating a constant challenge.</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Around this time, Cliff and Zoe decided to move to Canada, though their departure didn&rsquo;t make much of a difference since they had been living in Noosa and weren&rsquo;t actively involved in the restaurant. However, early in my lease, Cliff decided he didn&rsquo;t like the color of the building&rsquo;s exterior. Without consulting me or the landlord, he had Gary repaint it. Unsurprisingly, the landlord was furious. I tried to explain that changes like this required the landlord&rsquo;s permission, but they wouldn&rsquo;t listen.</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Another incident occurred just before I decided to sell the restaurant. The flat above the caf&eacute; had a bedroom, living room, bathroom, and kitchen where Gary lived. After taking a few days off, I returned to find that Gary had completely ripped out the kitchen and was renovating it. When I asked if he had obtained the landlord&rsquo;s permission, he admitted he hadn&rsquo;t, insisting he was \"making it better.\" While Gary was a skilled carpenter, he didn&rsquo;t understand that you can&rsquo;t make unauthorized changes to leased premises.</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;By this point, I had already decided to sell Caf&eacute; Mediterraneo and had placed it on the market. I didn&rsquo;t tell Gary about my plans at the time but urged him to finish the renovations quickly and hoped the landlord wouldn&rsquo;t show up for an inspection in the meantime.</p>\r\n<p dir=\"ltr\">&nbsp;</p>\r\n<p dir=\"ltr\">On top of business struggles, my personal life was deteriorating. Sheila and I grew increasingly distant. While she supported me in her own way, she avoided socializing or joining me on holidays, preferring her own routine centered around church and city visits. These issues compounded the stress of running the caf&eacute;, which was draining me financially.</p>\r\n<p dir=\"ltr\">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Ultimately, I decided to sell Caf&eacute; Mediterrano at a loss to cut my losses and move on.</p>\r\n<p dir=\"ltr\">The new owner converted it into an Irish pub, which turned out to be a better fit for the area, though it required significant investment to succeed.</p>\r\n<p>&nbsp;</p>\r\n</div>", "cover_image": "images/mediterrano_QHh7Cos.jpg", "slug": "chapter-21", "created_at": "2025-06-29T10:49:14.695Z", "updated_at": "2025-07-03T07:14:20.737Z", "order": 22}}, {"model": "chapters.chapter", "pk": 53, "fields": {"title": "Chapter 22", "subtitle": "<p>Business Ventures and Personal Struggles:Navigating Life in Cafe Mediterraneo on Caxton Street in Brisbane</p>", "content": "<div class=\"content\">\r\n<div>&nbsp; Cliff wanted to find employment for his son and suggested we take a trip down to Brisbane to explore opportunities that could provide all of us with jobs and a worthwhile investment. The idea for the Caxton Street restaurant was that Cliff would buy the building, while I would purchase and run the restaurant. I would pay Cliff rent and employ his son, Gary.</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; At the time, I had a registered company, Mickeycliff Pty Ltd, which made an offer to buy the restaurant. The offer was accepted, but then Cliff changed his mind about purchasing the freehold. This left me in a difficult position, with Mickeycliff Pty Ltd committed to the purchase. I felt I had no choice but to move forward with the deal&mdash;I didn&rsquo;t want a court case hanging over me.</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Caxton Street is a very busy area, situated near Suncorp Stadium. It&rsquo;s a vibrant nightlife hub, and at the top of the street, the old Victoria Barracks was slated to be transformed into a residential and shopping precinct.</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Despite the excitement of this business venture, things between Sheila and me were not going well&mdash;we seemed to be drifting apart. While Sheila supported me in her own way, she was never interested in mixing or socializing with others, nor did she enjoy taking holidays with me. As long as she could get to church or use public transport to travel in or out of the city, she was content.</div>\r\n<div>&nbsp;</div>\r\n<div>Sheila didn&rsquo;t drive and had no desire to learn.</div>\r\n<div>&nbsp;</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; When we returned to Brisbane to take over the running of the restaurants, we bought a lovely three-bedroom apartment in Paddington. It was conveniently close to Caxton Street, making it easier for me to manage Caf&eacute; Mediterraneo, and close to the city for Sheila.</div>\r\n<div>Caf&eacute; Mediterraneo was a disaster. The Brisbane Broncos moved from Suncorp Stadium to the ANZ Stadium in Mt Gravatt, leaving a significant gap in foot traffic on Caxton Street. Patrons no longer frequented the area for food and drinks. Additionally, the planned residential apartments and shopping precinct at the old barracks were shelved due to heritage restrictions.</div>\r\n<div>&nbsp;</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Caxton Street was full of restaurants, including Gambaro&rsquo;s, The LA Pub, Caxton Street Hotel, Casablanca Restaurant, Gambero&rsquo;s Seafood and Takeaway, and several nightclubs. The competition was intense, and trade was almost non-existent in the early days of the week. While Saturdays brought large bookings for hens&rsquo; nights, birthdays, and other celebrations&mdash;thanks to our courtyard&mdash;it still needed major repairs. During storms, the courtyard leaked everywhere, creating a constant challenge.</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Around this time, Cliff and Zoe decided to move to Canada, though their departure didn&rsquo;t make much of a difference since they had been living in Noosa and weren&rsquo;t actively involved in the restaurant. However, early in my lease, Cliff decided he didn&rsquo;t like the color of the building&rsquo;s exterior. Without consulting me or the landlord, he had Gary repaint it. Unsurprisingly, the landlord was furious. I tried to explain that changes like this required the landlord&rsquo;s permission, but they wouldn&rsquo;t listen.</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Another incident occurred just before I decided to sell the restaurant. The flat above the caf&eacute; had a bedroom, living room, bathroom, and kitchen where Gary lived. After taking a few days off, I returned to find that Gary had completely ripped out the kitchen and was renovating it. When I asked if he had obtained the landlord&rsquo;s permission, he admitted he hadn&rsquo;t, insisting he was \"making it better.\" While Gary was a skilled carpenter, he didn&rsquo;t understand that you can&rsquo;t make unauthorized changes to leased premises.</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; By this point, I had already decided to sell Caf&eacute; Mediterraneo and had placed it on the market. I didn&rsquo;t tell Gary about my plans at the time but urged him to finish the renovations quickly and hoped the landlord wouldn&rsquo;t show up for an inspection in the meantime.</div>\r\n<div>&nbsp;</div>\r\n<div>On top of business struggles, my personal life was deteriorating. Sheila and I grew increasingly distant. While she supported me in her own way, she avoided socializing or joining me on holidays, preferring her own routine centered around church and city visits. These issues compounded the stress of running the caf&eacute;, which was draining me financially.</div>\r\n<div>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Ultimately, I decided to sell Caf&eacute; Mediterrano at a loss to cut my losses and move on.</div>\r\n<div>The new owner converted it into an Irish pub, which turned out to be a better fit for the area, though it required significant investment to succeed.</div>\r\n</div>", "cover_image": "images/mediterrano.jpg", "slug": "chapter-22", "created_at": "2025-06-29T10:49:14.717Z", "updated_at": "2025-07-03T07:13:17.819Z", "order": 23}}, {"model": "chapters.chapter", "pk": 54, "fields": {"title": "Chapter 23", "subtitle": "<p>BaliHaiApartmentsNoosaoffer premium quality, large, 1,2 or 3 bedroom Apartments and 1, 2 or 3 bedroom Penthouses including private roof top terrace and spa. All apartments include full lounge and dining area with front facing balcony, full sized kitchen and laundry facilities and 1 or 2 bathrooms</p>", "content": "<div class=\"content\">\r\n<p data-end=\"193\" data-start=\"141\"><strong data-end=\"191\" data-start=\"141\">How We Got the Apartment and Management Rights</strong></p>\r\n<p data-end=\"316\" data-start=\"195\">We owe it all to Cliff and Zoe. It&rsquo;s a great story that truly shows how some people go out of their way to help others.</p>\r\n<p data-end=\"549\" data-start=\"318\">I first knew Matt Miller from Air NZ&mdash;he was senior to me, and we flew together many times in my early days with the airline. After I left Air NZ, I lost touch with everyone. That was until one day, Cliff and Zoe came to visit us.</p>\r\n<p data-end=\"630\" data-start=\"551\">As always, Cliff, with his dry wit, said, &ldquo;I have an offer you can&rsquo;t refuse.&rdquo;</p>\r\n<p data-end=\"793\" data-start=\"632\">I laughed and thought, <em data-end=\"688\" data-start=\"655\">where have I heard that before?</em> Oh yes&mdash;when he offered me that Italian restaurant in Weyba Rd, Noosaville. What a lemon that was!</p>\r\n<p data-end=\"1307\" data-start=\"795\">Anyway, I listened. The deal was this: Matt Miller had purchased the management rights to Bali Hai, along with the apartment. He and his wife had run the place for nearly a year when their daughter fell seriously ill in New Zealand. They wanted to be with her. At the time, Cliff and Zoe still owned Scoffers Inn, so they proposed a straight swap with Matt and his wife&mdash;giving them Scoffers Inn in exchange for Bali Hai&mdash;so they could free themselves to be with their daughter. And that&rsquo;s exactly what happened.</p>\r\n<p data-end=\"1524\" data-start=\"1309\">Then, knowing I was at a loose end, Cliff offered Bali Hai to me. The arrangement was simple: we would move in, run the place, build credibility, and</p>\r\n<p data-end=\"1524\" data-start=\"1309\">then try to secure financing to buy it outright from Cliff and Zoe.</p>\r\n<p data-end=\"1699\" data-start=\"1526\">And that&rsquo;s exactly what we did. Within a year, it was officially ours&mdash;mortgaged, of course&mdash;but none of it would have been possible without the generosity of Cliff and Zoe.</p>\r\n<p data-end=\"745\" data-start=\"170\">At the time, it felt like winning the lottery to have a two-bedroom apartment and a business in Noosa. Noosa Heads, the final resort on the Sunshine Coast where the river meets the ocean, has beautiful beaches and, when the winds are just right, great surfing conditions. On the north shore, ferries provide access for four-wheel drives to Fraser Island, the largest sand island in the Southern Hemisphere. The area is also surrounded by national parks with scenic walkways leading to other stunning beaches like Alexandria Bay&mdash;a well-known nudist beach&mdash;and Sunshine Beach.</p>\r\n<p data-end=\"954\" data-start=\"747\">During my time there, I did most of my jogging and training through the national parks. I was one of the first runners to participate in the inaugural Noosa marathon&mdash;back then, there were only eight of us!</p>\r\n<p data-end=\"1370\" data-start=\"956\">Being on-site managers during holiday periods was intense. We greeted guests, ensured they were comfortable during their stay, and cleaned up after they left, ready for the next holidaymakers. In those early days, there were defined seasons, with Christmas and Easter being the busiest times. In the winter, many of the apartment owners from the southern states would come to enjoy the warmer Queensland weather.</p>\r\n<p data-end=\"1838\" data-start=\"1372\">This seasonal flow gave us a bit of respite, as the owners took care of their units. Our payment structure as on-site managers included a monthly wage from the body corporate, a percentage of the holiday lets, and cleaning fees charged to the owners after each rental. There were 12 apartments in total&mdash;six in each tower. We lived in one, and the property developer lived in the penthouse of the left tower, leaving 10 apartments available for holiday rentals.</p>\r\n<p data-end=\"2113\" data-start=\"1840\">After a while, I realized it was too much for Sheila to handle all the cleaning on her own. I managed to convince Anna, Cliff and Zoe&rsquo;s daughter, to work alongside her. It was challenging, though&mdash;Sheila wouldn't speak to the guests or even answer the phone if I was busy.</p>\r\n<p data-end=\"2392\" data-start=\"2115\">I couldn't dedicate all my time to cleaning, as I had responsibilities in the office, handling the business side of the management rights. We were audited two to three times a year, so everything had to be in order. It was a lot to manage, but we found a way to make it work.</p>\r\n<p data-end=\"778\" data-start=\"101\">One day in the office, I received a phone call from Carolyn. The last time I had heard from her was when she was in Munich with Phillip. Phillip obtained his engineering degree in 1986, and like many young people after their studies, he decided to travel. He ended up in Munich, Germany, where he teamed up with two Australians who were manufacturing futon beds. They needed someone to deliver these futons to their customers, and Phillip saw an opportunity to make some cash while abroad. He started a transport business, delivering futons all over Europe. Within a year, he had two or three vehicles on the road, and it quickly became a very lucrative business for him.</p>\r\n<p data-end=\"1318\" data-start=\"780\">Carolyn had worked with Phillip for a while, but she wanted more experience in the hospitality industry. To gain that experience, she went to Austria for the winter season, which is where she was calling me from. We had a great conversation, catching up on her experiences. Then she mentioned that she was planning to do a bicycle tour. That sounded incredible&mdash;I had always wanted to do something like that. We agreed to join each other in May for a bicycle tour. It was an exciting prospect, and I began looking forward to the adventure.</p>\r\n<p data-end=\"364\" data-start=\"210\">We did the cycle ride, but not where we originally planned to go. However, it was a fantastic experience&mdash;I&rsquo;ll tell you more about it later.</p>\r\n<p data-end=\"816\" data-start=\"366\">Back at Bali Hai, my decision to join Carolyn led me to purchase a bicycle. I ended up with a Cannondale mountain bike, and with this new toy, I began training. Noosa&rsquo;s national parks provided the perfect setting for it. That&rsquo;s where I met the bank manager of the then Metway Bank, an enthusiastic mountain bike rider. We started training together, and over time, we became good friends. Naturally, we both quizzed each other about our professions.</p>\r\n<p data-end=\"1183\" data-start=\"818\">During one of these conversations, I learned more about his role at the bank. Seeing an opportunity, I soon approached him for advice on Bali Hai. After several weeks of discussions and negotiations, Bali Hai was finally ours, well partially. The bank had a big say in it, but Cliff and Zoe got their money, and we were all very happy. Or so I thought&hellip;</p>\r\n<p data-end=\"500\" data-start=\"129\">It was a good life. As I mentioned before, there were definite seasons&mdash;times when we were incredibly busy, followed by periods when Noosa became very, very quiet. The Sunshine Coast Airport hadn&rsquo;t been built yet, so the only way to reach Noosa was by road. The Bruce Highway was the main route, and at the time, the Sunshine Coast Motorway was still under construction.</p>\r\n<p data-end=\"766\" data-start=\"502\">The body corporate wage, combined with the income we made during the busy periods, provided a comfortable living, and the lifestyle was very pleasant. Cliff and Zoe had built a new home just a few blocks away, and we often enjoyed great coffee mornings together.</p>\r\n<p data-end=\"1059\" data-start=\"768\">Cliff and I also had a regular tradition&mdash;we would go out to do the lotto together. Over time, we became a familiar pair at the local newsagent. With our shared sense of humor, we always managed to brighten the day of the shop owner, who would often say that seeing us come in made his day.</p>\r\nAs time went on, Sheila seemed to withdraw more into herself. It became increasingly difficult for me to say the right thing or to encourage her to go out and enjoy the company of others beyond just the two of us. No matter how much I tried, I couldn't spark her interest in taking a holiday. Perhaps the workload was too much for her, or maybe there was something else weighing on her that I didn&rsquo;t fully understand. We lived in a beautiful apartment with stunning views across Laguna Bay and were earning a fair living. I made sure we attended Sunday Mass and feast days, but despite all this, Sheila seemed unhappy and reluctant to socialize. Some weekends were particularly busy, especially on the bright, sunny winter days when we had a full house. The steady flow of guests was great for business, helping to keep the cash flow healthy. Every now and then, visitors would ask, &ldquo;Are you on the market to sell?&rdquo; My usual response was a firm &ldquo;No.&rdquo; But some people wouldn&rsquo;t take that for an answer. They would urge me to think about it, name a price, and let them know&mdash;often following up persistently. This happened so many times that, sooner or later, I knew there would come a moment when it caught me at a low point&mdash;when I was feeling worn down, or perhaps when that familiar shadow of doubt, the &lsquo;black dog,&rsquo; was lurking. And sure enough, one day, in a moment of frustration or uncertainty, I threw out a ridiculous price&hellip; and to my surprise, it was accepted.</div>", "cover_image": "images/balihainoosa.jpg", "slug": "chapter-23", "created_at": "2025-06-29T10:49:14.742Z", "updated_at": "2025-07-03T07:12:24.614Z", "order": 24}}, {"model": "chapters.chapter", "pk": 56, "fields": {"title": "Chapter 24", "subtitle": "<p>From Paddington to Redcliffe: A Tumultuous Journey &amp; The Hardest Decision: Drifting Apart Amid Promises and Betrayals</p>", "content": "<div class=\"content\">\r\n<p>I have to talk about a part of my life that is very difficult to discuss. To tell you about it, I have to go back to when I started with Continental Agencies and was living in a gated complex in the western suburbs.<br>We arrived at the complex the day we moved out of the apartment we had sold in Paddington. We had thought we had secured a rental property in New Farm, a Brisbane city suburb. However, the day before we were due to move, we received a call from the agent informing us that we could not move into the New Farm apartment because the owners had not completed their purchase.<br>And so, we ended up at Bali Hai Jindalee&mdash;it was the only place we could find on short notice.<br>I have to say now that I did not want to sell the Paddington apartment. Cafe Mediterrano had sold&mdash;at a loss, I might add. At that time, I was not thinking straight, and Sheila was very upset with everything that had happened. After selling Cafe Mediterrano, I purchased a small catering business, The Diet Place. We worked on that for nearly a year before Continental Agencies bought it from me. This would have been 1999.<br>Continental Agencies had secured a contract with Woolworth&rsquo;s to manufacture fresh pizzas for all their stores in Queensland. As part of this expansion, they offered me the task of setting up a production line in the premises they had acquired from me.<br>Our first order was 700 pizzas, which was followed by continual increases until we eventually reached over 40,000 per week. The pizza manufacturing was running well, and the staff were well trained in production.<br>In 2001, Continental Agencies purchased Ronda Foods, and I was asked to become their production manager. I negotiated a better remuneration package, which was agreed upon, and I was given a fuel card along with a small pay rise.<br>During my first two years there, I developed the HACCP (Hazard Analysis &amp; Critical Control Point) manual and controls, which were required for all food manufacturing companies. Additionally, I had the factory certified for Halal. Then, in 2003, Continental Agencies sold Ronda Foods. I was kept on by the new owners as their production manager. However, when Ronda&rsquo;s was sold, Continental Agencies took away my fuel card, and the new owners refused to replace it. They showed no sympathy. Six months later, they sold the business again to a couple.<br>At first, these new owners were very pleasant, and we got along well. We introduced new products, and things seemed to be going well. Around this time, Continental Agencies also sold the Woolworth&rsquo;s pizza production to another company&mdash;along with the computer program I had designed to manage the production process. When they sold, I received nothing. All the hours I had spent creating that system amounted to nothing.<br>During all this time, Sheila was travelling to different places around Brisbane. One such place was Redcliffe, a seaside town on a peninsula about 40 kilometres from the city. She managed to talk me into visiting, and to my surprise, it was a lovely town&mdash;no high-rises, only a few apartment developments being built, and prices far cheaper than other Brisbane suburbs.<br>After seeing these apartments, we discussed the idea of living by the sea. We found one in Baywatch Marine Parade, Redcliffe, and I came up with a plan that I thought would benefit both Sheila and me, as well as my daughter and her husband. I offered them both a sum of money as a deposit to purchase the apartment. We had a rental agreement to pay them rent, and they could use the property as a negative gearing investment to assist with their taxes, as they were both on good salaries. They accepted the offer, and we moved into the apartment in December 2000.<br>In the following year, I became the body corporate secretary and started making acquaintances with other owners in the complex. We would often meet for morning coffee and drinks, which was great. However, Sheila refused to have anything to do with anyone and went out of her way to avoid them. This was difficult for me&mdash;it had been the same when we owned Bali Hai Noosa.<br>At the time of our agreement, my daughter and her husband owned a home in Forest Lake. He worked for Continental Agencies, and my daughter, I believe, worked at a bank.<br>Some time after our agreement, he told me he had secured a position in Sydney, which meant that he and the family would be moving. I was concerned, knowing this could affect our future in the apartment. I remember walking along the seaside in Redcliffe when he told me of his plans. He reassured me they would never sell Baywatch.<br>However, as their move approached, I asked whether they were planning to rent out their Forest Lake home. To my surprise, he said they were going to sell it but would be renting in Sydney. I warned him that selling their home was a big mistake, but my advice was ignored. Several years later, when they returned to Brisbane, they found house prices had increased significantly.<br>At this time, I was deeply involved with Ronda Foods and was overdue for some leave, having not taken a holiday in a couple of years due to the constant changes in ownership. It was agreed upon, so I finally booked a holiday for September 2005.<br>Then, at Easter 2005, my Daughter &amp; husband visited us at Baywatch and dropped the bombshell: they were going to sell the apartment, despite previously assuring us they never would.&nbsp;<br>They didn&rsquo;t consult us or explain their reasons. I even offered to pay more rent, but my offer was rejected.<br>I was devastated&mdash;I truly did not know what to do. We had been there for over four years, and while I was happy, Sheila continued her outings back to the city. I thought she was content, even though we did not socialise much.<br>Now comes the most difficult part of my story, but it must be told&mdash;even if it is only my side of what happened.<br>At Easter 2005, we also had a visitor from the UK staying with us for a couple of weeks. We had taken many day trips, showing off Brisbane and the surrounding countryside, and we all enjoyed each other&rsquo;s company. During one of our conversations, I mentioned I was due for a holiday and planned to visit the UK to see family. Our visitor kindly offered me accommodation if I was visiting.<br>I had always asked Sheila if she wanted to go on a holiday, but she had no interest. So, I told Sheila that I had booked leave from Ronda Foods for September. Meanwhile, the apartment was scheduled for auction in May. When Sheila and I discussed our next steps, her response floored me:<br>\"We just have to move back to Brisbane.\"<br>Reflecting on it, in all our 40 years together and all the moves we made&mdash;were they for Sheila? Every decision, apart from moving to New Zealand, seemed to revolve around her needs. In the later years of our marriage, she started to withdraw. It became increasingly difficult to have conversations with her.<br>What hurt me the most was that I still loved her dearly and longed for a real connection one where we could laugh, share drinks, go out for a nice meal, or watch a show together. We had both worked hard all our lives and raised five wonderful children.&nbsp;<br>But the weight of everything caught up with me. The stress of running businesses, financial worries, and the pressure to always push forward had taken their toll. Depression lurked in the shadows, sometimes nipping at my heels, other times dragging me into the depths.<br>When I returned from my holiday, two or three days after returning to work, one of the owners joined me during my morning coffee break. His attitude toward me suddenly turned hostile. A simple conversation escalated into a heated exchange, and by the end of it, he had practically forced me to hand in my notice.<br>That was the final straw. After years of trying to do the right thing, everything had collapsed. I had lost so much.&nbsp;<br><br></p>\r\n</div>", "cover_image": "images/baywatch.jpg", "slug": "chapter-24", "created_at": "2025-06-29T10:49:14.793Z", "updated_at": "2025-07-03T07:11:22.455Z", "order": 25}}, {"model": "chapters.chapter", "pk": 57, "fields": {"title": "Chapter 1", "subtitle": "116 Antrobus Rd, The Royal Town of Sutton Coldfield, Birmingham, UK. King Henry VIII granted Sutton Coldfield the \"Royal\" designation in 1528. This recognition was due to its historical association with the Royal family and its importance as a centre of hunting grounds and woodlands used by the monarchy.", "content": "<p>What a time to have arrived on this earth! World War Two had just erupted in September 1939, plunging the world into chaos and uncertainty. As the United Kingdom was reluctantly drawn into another global conflict, families across the nation faced the grim reality of separation, sacrifice, and survival. Amidst the turmoil of war, amidst the echoes of distant battles and the shadows of impending danger, a new life entered the world, destined to navigate the challenges and opportunities of a tumultuous era. On my arrival, I joined&nbsp;<a href=\"https://mystory-yt5w.onrender.com/media/images/dadmum.jpg\" target=\"_blank\" rel=\"noopener\" data-lightbox=\"gallery\">Mother &amp; Father&nbsp;</a> and three brothers: Michael, born in 1933; Lionel, in 1934; and David, in 1936. According to my birth certificate, my father's occupation was listed as a \"Businessman,\" a title that conjures up all sorts of images of success, power, and ambition. However, as I grew older and came to know him better, I discovered that he was much more than that. He was a lovable, kind-hearted man, adored by all who knew him. With his infectious charm and gift of gab, he could light up any room and make even the most mundane moments memorable. Despite facing the challenges of being of the Jewish faith, he carried himself with dignity and resilience, embodying the values of compassion and perseverance. Unfortunately, he passed away in September 1951 when I was only eleven years old. But in all my time with him, he taught me the value of integrity, compassion, and hard work, shaping me into the person I am today. His legacy lives on in the lessons he imparted and the love he shared, guiding me through life's journey with his enduring wisdom and grace. More about my father later on, my Mother was considerably younger than my father, hailing from Dover, Kent, where my early years unfolded. A period I'll delve into in detail later. While my recollections of her during that time are limited by my tender age, the stories I've heard paint a vivid picture of her remarkable character. They say she possessed a culinary talent beyond compare, a trait I would come to appreciate fully in later years. Yet, her skills in the kitchen were merely a reflection of her boundless love and care as a mother. She dedicated herself wholeheartedly to raising her four sons, navigating the challenges of life with unwavering strength and grace. Despite the hardships she encountered, my mother remained steadfast in her commitment to our family, selflessly putting our needs above her own. Her love was the bedrock of our household, her presence a constant source of warmth and comfort. She was not only the heart of our family but also the glue that held us together through every trial and triumph. Her legacy extends far beyond her culinary creations; it lives on in the love she shared and the values she imparted. Through her example, she taught us the true meaning of resilience, compassion, and unwavering devotion. As I continue to recount my story, I look forward to delving deeper into the memories and moments that define her enduring influence on my life. My memories of Antrobus Street exist only through the stories my mother shared with me over time. It was in 1941, amidst the chaos of World War II, that our family decided to leave Antrobus Street and relocate to Waltham Abbey in London. The war was raging on, and England's vulnerability meant that bombings were a nightly occurrence, casting a shadow of fear over our lives. During this uncertain time, my brothers were evacuated to Wales for safety. As for me, I was deemed too young to leave my mother's side, so I remained in London throughout the war, not seeing my brothers until its end in 1945. The separation from my brothers and the constant threat of bombings were challenging experiences that defined my early years. Yet amidst the turmoil, there was a sense of resilience and determination to endure. My family's story, like so many others during that time, is a testament to the strength and courage of ordinary people facing extraordinary circumstances. Reflecting on these memories, I'm reminded of the sacrifices made by my family and countless others during World War II. It's a chapter of my life that shaped who I am today, instilling in me values of resilience, unity, and gratitude for the peace we now enjoy. As I continue to write my story, I honor the past and embrace the journey that has led me to where I am today.</p>", "cover_image": "images/Longmoor_Pool_-_Summer_2007.jpg", "slug": "chapter-1", "created_at": "2025-06-29T22:34:47.918Z", "updated_at": "2025-07-01T03:41:17.007Z", "order": 2}}, {"model": "chapters.chapter", "pk": 58, "fields": {"title": "Chapter 2", "subtitle": "<p>Waltham Abby Epping The town is named and renowned for its former abbey, the last in England to be dissolved, now the Abbey Church of Waltham Holy Cross and St Lawrence, a scheduled ancient monument, and the town's parish church.</p>", "content": "<p>The forest of Epping, nestled in Waltham Abbey, is not only a sanctuary for diverse wildlife, such as deer, foxes, and birds, but also a haven for history enthusiasts, boasting ancient relics like the ruins of Waltham Abbey, dating back to the 12th century. Despite its tranquil allure, the forest bore witness to the tumultuous years of war, with numerous military bases dotting its landscape. Amidst the serene ambiance, the sight of army trucks and soldiers underscored the gravity of the era. Additionally, the presence of a dedicated army of land girls, young women aiding in agricultural and horticultural endeavors, added to the tapestry of wartime life. As a mere infant at the time, my memories of Waltham Abbey during these years are fleeting, with only a vague recollection of an accident lingering in my mind..<br>&nbsp; &nbsp; &nbsp; &nbsp; By all accounts, the incident unfolded swiftly as I found myself lifted by the gentle hands of a couple of these land girls, undoubtedly charmed by the innocence of a young child. Placed atop one of their bicycles, I must have presented an irresistible sight, prompting their spontaneous act of kindness.<br>&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; As we strolled along the footpath, the tranquility of the forest was momentarily disrupted by the rumble of an approaching army convoy. Caught up in the moment, the young ladies, exuding a sense of glamour amidst the natural splendor, exchanged smiles and waves with the passing soldiers. Little did they know, nor perhaps did the soldier at the wheel realize, that protruding from the back of one of the trucks was an iron girder, concealed from view.<br>&nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; As the convoy straightened its course, the inevitable collision occurred the end of the girder meeting my unsuspecting head. The ensuing chaos unfolded in a whirlwind of confusion and concern, leaving an indelible mark on all involved<br>&nbsp; &nbsp; &nbsp; &nbsp; To this day, a faint scar on my scalp serves as a tangible reminder of life's fragility and the capricious hand of fate. Despite the gravity of the incident, the details remain shrouded in the haze of memory. Legal action was pursued on my behalf by my father, resulting in a compensation award. However, the funds were held in trust until my twenty-first birthday, marking the beginning of another tale yet to unfold.<br>&nbsp; &nbsp; &nbsp; &nbsp; The next event in my life moving down to Dover in 1947.</p>", "cover_image": "images/Epping_Forest.jpg", "slug": "chapter-2", "created_at": "2025-06-29T22:40:21.871Z", "updated_at": "2025-07-01T03:42:15.167Z", "order": 3}}, {"model": "chapters.chapter", "pk": 59, "fields": {"title": "Chapter 3", "subtitle": "<p>DOVER is a town and major ferry port in Kent, South East England. It faces France across the Strait of Dover, the narrowest part of the English Channel at 33 kilometres (21 mi) from Cap Gris Nez in France.</p>", "content": "<p>I found this&nbsp;<a title=\"Movie of Dover\" href=\"https://www.youtube.com/watch?v=jP0QRTP554s\" target=\"_blank\" rel=\"noopener\">Movie of Dover</a>&nbsp;it will give you a good idea what Dover was like just after the war.Mum and Dad were entrepreneurs; they were the first to obtain a hotelier's license in Dover after the war. With this, they opened \"Clare House\" and operated a guesthouse at 138 Folkestone, Dover. This establishment marked the beginning of my childhood memories, preceding our departure from Epping. The reunion with our sons and brothers filled us with joy, as the war had ended, although rationing still persisted for most foods.</p>\r\n<p>&nbsp;I believe Mum and Dad ventured into the hospitality industry due to the availability of extra rationing coupons, providing them with resources to sustain their business. Naturally, this aspect of our family's affairs was kept discreet, not to be discussed outside our family circle. With the extra rationing coupons acquired for the hotel business, Dad managed to obtain fuel for a vehicle a Vauxhall, from what I remember. It resembled an ex-army vehicle, likely one that served military personnel during the war. Its spacious interior accommodated all of us boys, along with Mum, with Dad at the wheel. We embarked on day trips, exploring the countryside and visiting quaint villages. Occasionally, Dad would pull over at a cozy pub, where we enjoyed refreshing lemonades while Mum and Dad indulged in their favorite drinks.</p>\r\n<p>&nbsp;One memorable occasion stands out: when we visited Dad's relatives in Eastbourne. It marked my introduction to Jewish cuisine at the tender age of seven. The table was adorned with delicacies like smoked salmon, rollmops, matzos, anchovies, and potato salad. This culinary experience sparked my lifelong love for fine foods, igniting a passion at a young age.&nbsp; With the reopening of the channel, Dover bustled with activity as people flocked to use the cross-channel ferries. This surge in visitors kept Mum and Dad busy at the guesthouse. After about a year, ever the one to seek improvement, Dad decided to relocate us to a larger residence, providing more rooms for guests. Thus, we packed our belongings and moved across the road to 167 Folkestone Road.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;</p>\r\n<p>It was during this time that I grew particularly close to<a href=\"https://mystory-yt5w.onrender.com/media/images/mydad.jpg\">&nbsp;My Dad</a><a title=\"My Dad\" href=\"https://mystory-yt5w.onrender.com/chapters/chapter/chapter3/static/media/images/mydad.jpg\" target=\"_blank\" rel=\"noopener\">&nbsp;</a>my father. I often accompanied him on his shopping trips, eagerly climbing into our beloved Vauxhall. I felt a sense of pride every time I stepped into the car, especially considering that owning a car alone was enough to turn heads at that time. Dad also acquired a little dog, Rex, a crossbreed of unknown origin. Whenever Rex was in the back of the car, he was fiercely protective, barking at anyone who dared approach the vehicle. Dad found solace in knowing Rex was there, ensuring our safety. On our shopping trips back then, supermarkets where you could buy all you need in one place didn't exist. Instead, we frequented local shops a butcher, grocer, fruiterer, and even farms for fresh chicken. I mean really fresh Dad would choose one, and the farmer would promptly prepare it while it was still running around, ending its life in front of us. But let's get back to the shopping.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>Dad would stride into these stores with me following in awe. \"Hi, Morrie!\" Each manager would emerge from their office to greet him, extending their hand for a handshake. This ritual occurred every visit, and there I was, a little me, following in his footsteps. It was the best feeling for me. I was bursting with pride for my father. Though I didn't fully grasp what pride meant at that age, I was in awe and loved him immensely. With each time returning to our vehicle, the car boot was full of different kinds of food In all my childhood memories, this period stands out as the best for me. The parties Mum and Dad threw for their friends and business colleagues were brilliant. From a young age, I observed a diverse array of people from various occupations attending these gatherings. While my brothers and I were included to a certain extent, as the parties progressed into the evening, we were gently dismissed to our bedtime!<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Despite being relegated to our rooms, the energy and excitement of the parties lingered in the air, leaving an indelible impression on my young mind. From the laughter and music to the tantalizing aroma of food, these were a testament to our parents' hospitality and social prowess. Though we may have been tucked away in bed, the memories of those lively gatherings remain etched in my heart.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Another memory I have of my father involves him in the kitchen, always cooking something up for us boys. Whenever the front doorbell rang, he would hurriedly make his way to answer it, donning his oversized white apron. With a quick flick, he would fold back one corner of the apron as if it weren't there at all. Upon greeting whoever stood at the door, he would immediately tune into their accent or language, effortlessly imitating them. This knack for mimicry endeared him to everyone he met, fostering instant rapport and camaraderie. He had a remarkable ability to connect with people from all walks of life, a talent that earned him admiration and respect. In my eyes, he could sell ice to the Eskimos.My schooling journey began with attendance at three primary schools. The first was Belgrave Primary, situated right opposite the first clare House atop a steep hill. My memories of it are fleeting, but I distinctly recall its location across a busy road.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;Next was St. Mary's Primary in Stembrock, a district in the downtown area. Although I can't recall the duration of my stay, both schools were housed in ancient buildings.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; The third, St. Martins Primary in Elms Vale, remains vivid. I found enjoyment there, as it boasted modern facilities compared to the previous two. However, I encountered a challenging experience with an English teacher. During a test, sunlight streaming into the room made the blackboard unreadable. When I leaned forward to get a better view, the teacher accused me of cheating. Despite my protests, the situation escalated, leading to my departure from the school. Fortunately, my father believed my account of the incident.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Meanwhile, my brothers Michael and Lionel were old enough to apply to join the Royal Navy HMS Mercury training school. David must have been attending a school in Dover.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Subsequently, David and I were enrolled in Horam boarding school for boys near Hailsham, Sussex. The school boasted excellent teachers and picturesque grounds. The Principal, a passionate butterfly collector, nurtured my interest in entomology. Despite the pleasant environment, I struggled with the mandatory Sunday tea of macaroni cheese and goat's milk, leading to clandestine food exchanges among dormitory mates.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; However, my time at the boarding school was short-lived due to a severe case of ringworm. Placed in quarantine, I stayed with an Uncle and Auntie nearby for three months, undergoing treatment at Middlesex Hospital. Despite efforts to cure the ringworm, it persisted, resulting in the nurses' manually removing each affected hair, a process I endured longer than any other patient.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; During my absence, my nephew Peter was with us at the boarding school. He was briefly sent to stay with me at our relatives, but his parents promptly retrieved him. Consequently, I found myself residing with unfamiliar relatives who imposed strict rules, possibly due to my infectious condition.<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&nbsp;<br>&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; Looking back, my schooling years so far were a mixed bag of challenges and memorable experiences, shaping me in unexpected ways.</p>\r\n<p>&nbsp; In December 1950, a new addition to the family arrived: my little brother, Phillip. With his arrival, the Magner family grew to include five boys. Additionally, I took on the responsibility of caring for Phillip during his early years, a role I can elaborate on later.</p>", "cover_image": "images/dover.jpg", "slug": "chapter-3", "created_at": "2025-06-29T22:42:52.830Z", "updated_at": "2025-07-01T03:43:14.267Z", "order": 4}}, {"model": "chapters.chapter", "pk": 60, "fields": {"title": "Chapter 4", "subtitle": "<h3 class=\"subtitle-section\">Growing Up in Dover Dover in the 1950s remained scarred by the ravages of war, with bomb sites and debris still littering the landscape long after the conflict had ceased...</h3>", "content": "<p>After being given the all-clear from the hospital, signifying that I was no longer infectious due to the successful eradication of the ringworm, I returned home to clare House. I still had to wear something on my head as I was bald from having all my hair removed to treat the ringworm, although it was starting to show some growth as each day passed, with stubble beginning to appear. Resuming my education meant that returning to the boarding school was no longer an option. David was no longer there, much to his delight at being back home. However, after a week or so, I found myself being taken to another school, The Manor House Day School in Hythe.<br>The school was situated in a literally Manor House, a grand mansion set amidst wonderful grounds, surrounded by an amazing array of different plants, bushes, and trees. There was even a very old-looking Mulberry tree that was fruiting at the time of my visit. The uniform we had to wear was a bright red, almost scarlet, peaked cap, along with a single-breasted blazer and gray flannel trousers. I loved it! There was just one slight problem with attending this wonderful school it was about 25 miles from clare House, and there was nobody available to take me there or bring me back home. However, my father, on the way home from our visit to the school, drove me to the Folkestone bus station and showed me how we could overcome this problem. On school days, I would don my bright hat and blazer and board a bus that stopped right outside clare House, heading to the Folkestone bus station. From there, I would catch another bus to Hythe and the school. With the buses running on time, the journey took just under an hour. And so, I embarked on another phase of my school life. Surprisingly, despite my baldness, I was not harassed by the other boys. In fact, they were quite friendly, and I made good friends with one of them. Attending the lessons was not a chore; quite the opposite. We covered all the usual subjects and even delved into a couple of languages. I learned a lot during my time at this school. I didn't mind the traveling, especially as wearing the colorful uniform often sparked conversations with other passengers on the bus. I suppose I'm a bit of a showman at heart!<br>Life during that time held its own blend of joys and sorrows. While weekdays were spent immersed in a school that captured my heart, weekends offered solace among the few friends I had made at 167 Folkestone Road.<br>However, the shadow of poverty loomed over the streets surrounding clare House, particularly Clarendon Street and Clarendon Place, where terraced houses lined the roads, punctuated only by corner shops and the occasional chippie.<br>My friendships, forged during my time at Belgrave Primary School, provided a sense of connection, even if you didn't always engage in regular play together. Yet, amidst these fleeting moments of camaraderie, a devastating blow struck. Returning home one day during a game of football, I was met by a neighbour who delivered the heart-wrenching news: my father had passed away from a massive heart attack. It was a moment that shattered my world, leaving me with grief and uncertainty. Losing the person I loved most at such a tender age was an unimaginable pain to bear, marking September 1951 as a turning point in my young life. I was told later, that baby Phillip was on my Fathers knee when this awful event took place.<br>Several days following the tragic event, the family gathered in the downstairs lounge to discuss the arrangements for our father's funeral. Among those present, I recall my brother Michael, who had returned home after being invalided out of the navy, adding another blow to our already grieving family. Lionel, dressed in his naval uniform, was there too, alongside David, who was undergoing training at a hotel in Folkestone, a placement arranged by our father. Another notable presence was my step-sister Zena, the mother of Peter, who had been with us at the Horsham boarding school. And, of course, our brave and courageous mother.<br>However, what followed during that discussion has remained etched in my memory, haunting me with unanswered questions to this day. I cannot recall the exact words or actions that triggered it, but Zena became upset with something that I said or did. Without anyone coming to my defense or explaining the situation, she made the painful declaration that I should not attend our father's funeral. The absence of clarity surrounding my exclusion from the funeral has left me grappling with unresolved feelings and a lingering sense of incompleteness regarding my father's passing.<br><br>Life without Dad brought significant challenges, especially for our mother, who not only managed the hotel but also bore the weight of its financial burdens. In the subsequent year, I lost my placement at Manor House School due to the overwhelming cost of tuition. By February 1952, at the age of twelve, I was enrolled in Astor Avenue Secondary Modern School. Over the next three years, life settled into a routine as we navigated the best we could. Michael stepped in to assist Mum with the day-to-day operations of the business, while she received support from Biddy, a kind-hearted lady, and Irene, a young helper. Attending school became a mechanical task for me; though physically present, my mind wandered elsewhere, struggling to find focus. Every lunchtime, I walked home to clare House, where Mum or Biddy would ensure I had a meal. After eating, I bid farewell and retraced my steps back to school a routine I repeated for the duration of my time there. While classmates formed bonds and engaged in games, I remained somewhat isolated, lacking close friends.<br>On weekends, I took on the responsibility of looking after Phillip, often taking him out in his pram for outings. One memorable day, we visited Penchester Park, where a small river flowed toward the seafront. As we sat by the bank enjoying sandwiches prepared by Biddy, a startling sight caught my eye a white bundle floating downstream. Reacting swiftly, I secured the pram and rushed into the water, rescuing a baby as it drew near. We scanned the area upstream, where we spotted an overturned pram; the baby, unstrapped, had tumbled into the river. Moments later, a distressed woman arrived, frantically searching for her child. Seeing the woman I gladly returned the baby to her, who was overcome with relief and gratitude and asked for my name. Then we had to return home, I was soaking wet, will I be believed when I tell what had happened?<br><br>Another significant event for the family was Michael marrying Irene, a natural progression given their close working relationship. Irene was a lovely young woman, while Michael was both intelligent and handsome, having earned accolades for his academic achievements, including passing exams with merits. Despite being on a path that could have led him to university, he chose to join the Royal Navy.<br>I remember a particular moment when we were both in the lower lounge, Michael studying for a customs exam while we listened to classical music. Suddenly, Michael began shaking uncontrollably, experiencing convulsions. I rushed to his side, feeling utterly helpless. Thankfully, Mum heard my panicked shouts and rushed to our aid. She guided Michael to the floor, directing me to fetch a spoon from the cutlery drawer. Placing the spoon in his mouth, she prevented him from biting his tongue until the episode passed, and Michael could rest.<br>Confused and concerned, I asked Mum what had happened. It was then that she revealed the reason for Michael's departure from the Navy: he was epileptic. He had experienced similar episodes in his youth, and while doctors had suggested he might outgrow them, the incident on board his ship proved otherwise.<br>Lionel continued to thrive in his naval career, achieving the rank of petty officer, though the specifics of his duties remained a mystery to us. The last time we saw him was at Michael's wedding, where he mentioned his upcoming assignment on the aircraft carrier HMS Centaur. There's one remarkable moment I must mention about Lionel: he was selected as one of the sailors to pull the gun carriage carrying King George during his funeral parade in London.<br>Meanwhile, David decided to leave his position at the Burlington Hotel in Folkestone as the summer season approached in Dover, signaling the start of the cross-channel ferry operations. He joined one of these ships, effectively becoming a part of the Merchant Navy.<br>When you work on these vessels, you sign articles for the duration of the voyage and receive a discharge book, akin to a passport, with your photo and relevant details. Upon completing your term, the book is stamped again, indicating your rating. In David's case, his rating was Asst Stwd (Assistant Steward). This book could serve as a portfolio for future employment opportunities with other companies.<br>With Micheal married Lionel and David occupied with their careers, I found myself as the only one left who could offer assistance to my mother. Of course, Phillip was there, but he was still too young to fully understand the situation.<br><br>One day, I encountered a lady who lived a few doors away from clare House, Mrs. Cotton. I believed she was an acquaintance of my mother. As I was entering my teens, I found her quite attractive for her age, being a widow. Mrs. Cotton mentioned to me that she owned a Fruit &amp; Vegetable shop on Dover's Tower Street and was in need of someone to handle deliveries on Saturday mornings and occasionally on Wednesday afternoons. Without hesitation, I eagerly accepted the offer, thrilled at the prospect of my first part-time job that would provide me with my own pocket money to spend however I pleased.<br>Dover boasted four cinemas in total. The Odeon, situated atop the town, was the most prestigious, albeit not easily accessible. Despite the challenge, it was considered the best in Dover, with an organ that played enchanting music before each film screening. Decked out in ornate decor from the 1930s, a visit to the Odeon promised an enjoyable experience with a unique ambience.<br>The Gaumont cinema, located in midtown, was a more modern establishment, offering comfortable seating and continuous movie screenings throughout the week. This was the cinema I frequented most often, as it was conveniently situated for me. I recall one memorable evening when I took my heavily pregnant mother, a fan of one of the film stars, to a screening. As we exited the auditorium, I had to intervene when she inadvertently linked arms with a bewildered stranger, jokingly I said to her \"come on Mum you have enough men in her life already, let that poor man go \".<br>Another cinema I frequented was the Plaza, a little further down from the Gaumont. Although it was nicknamed 'The Flea Pit' due to its affordability, I always enjoyed my time there. One film that left a lasting impression on me was 'Carmen' starring Dorothy Dandridge; I was so captivated by the music and singing that I watched it three times. Lastly, there was the ABC Grenada, just off the market square. As a child, I was allowed to attend the Saturday morning screenings, which were tailored for young children like myself. This early introduction to cinema became a regular part of my routine, especially in my early teens, now that I had a part-time job.\"<br>I must have watched nearly every movie featuring Humphrey Bogart, James Cagney, George Raft, Lon Chaney, Peter Lorre, Clarke Gable, John Wayne, and the list goes on. Each film left its mark on me, not necessarily for the violence, which by today's standards was relatively mild, but for the compelling stories they told.<br>In my late teens, I witnessed the birth of rock &amp; roll music, which became widely available. I fondly recall attending Saturday night dances at the town hall and the Co-op hall, where I had the privilege of seeing live performances by Lonnie Donegan and Bill Haley and His Comets. Then came the emergence of coffee shops with jukeboxes. I vividly remember one evening, dressed in my best attire, I strolled down to the market square where a new coffee shop had opened its doors. As I approached, the vibrant sounds of rock &amp; roll spilled onto the street, drawing me in. However, in my eagerness, I failed to notice the clear glass front door and embarrassingly walked right into it, becoming unintentional entertainment for those inside. Despite the embarrassment, I quickly gathered myself and turned away, never returning to that coffee shop again.<br>In those years, there were gangs of youths known as Teddy Boys, clad in long jackets and drainpipe trousers, with thick crepe-soled shoes often referred to as 'beetle crushers.' Most of these boys sported a hairstyle slicked back into what they called a 'Ducks Arse.' Whenever I caught sight of them, I swiftly retreated to avoid their notice. Another group that emerged during that era were the Mods, distinguished by their clean-cut appearance, tight-fitting suits, and pointed shoes known as 'winkle pickers.' Their preferred mode of transportation was the Vespa scooter. I always steered clear of these subcultures, preferring to remain a loner rather than aligning myself with any particular group.</p>", "cover_image": "images/bombsites.jpg", "slug": "chapter-4", "created_at": "2025-06-29T22:45:52.005Z", "updated_at": "2025-07-01T03:47:21.850Z", "order": 5}}, {"model": "chapters.chapter", "pk": 62, "fields": {"title": "Epilogue", "subtitle": "<h2><strong>What survives of us is love&nbsp;</strong></h2>", "content": "<p>&nbsp;&nbsp;is a poignant phrase that suggests the enduring nature of love beyond our physical existence. It implies that, despite the impermanence of life, the love we give and share continues to live on in the memories and hearts of those we leave behind. This sentiment captures the essence of human connection and the lasting impact of our relationships. Whether through acts of kindness, cherished memories, or the influence we have on others, love becomes a timeless legacy. In the face of mortality, love remains a source of comfort, solace, and hope, transcending the boundaries of time and space. It is a reminder that our capacity to love and be loved is what truly defines our humanity and shapes our legacy in the world</p>", "cover_image": "images/epilogue.jpg", "slug": "chapter-27", "created_at": "2025-06-30T00:47:32.087Z", "updated_at": "2025-06-30T00:47:32.087Z", "order": 28}}]